[{"entry_id": "2407.20232v1", "title": "Specify and Edit: Overcoming Ambiguity in Text-Based Image Editing", "summary": "Text-based editing diffusion models exhibit limited performance when the\nuser's input instruction is ambiguous. To solve this problem, we propose\n$\\textit{Specify ANd Edit}$ (SANE), a zero-shot inference pipeline for\ndiffusion-based editing systems. We use a large language model (LLM) to\ndecompose the input instruction into specific instructions, i.e. well-defined\ninterventions to apply to the input image to satisfy the user's request. We\nbenefit from the LLM-derived instructions along the original one, thanks to a\nnovel denoising guidance strategy specifically designed for the task. Our\nexperiments with three baselines and on two datasets demonstrate the benefits\nof SANE in all setups. Moreover, our pipeline improves the interpretability of\nediting models, and boosts the output diversity. We also demonstrate that our\napproach can be applied to any edit, whether ambiguous or not. Our code is\npublic at https://github.com/fabvio/SANE.", "pdf_path": null, "cn_title": "\"明确与编辑：文本驱动图像编辑中的模糊性克服\"", "cn_summary": "基于文本的编辑扩散模型在用户输入指令模糊时表现出有限的性能。为了解决这个问题，我们提出了\"指定并编辑\"（SANE），一个针对基于扩散的编辑系统的零样本推理管道。我们利用大型语言模型（LLM）将输入指令分解为具体的指令，即应用到输入图像以满足用户要求的具体干预措施。通过一种专门为任务设计的新型去噪指导策略，我们可以从LLM产生的指令和原始指令中受益。我们的实验在三个基线和两个数据集上表明了SANE在所有设置中的优势。此外，我们的管道提高了编辑模型的可解释性，并增强了输出多样性。我们也证明了我们的方法可以应用于任何编辑，无论是否模糊。我们的代码在https://github.com/fabvio/SANE公开。", "update_time": "2024-07-29 17:59:57+00:00", "publish_time": "2024-07-29 17:59:57+00:00"}, {"entry_id": "2407.20230v1", "title": "SAPG: Split and Aggregate Policy Gradients", "summary": "Despite extreme sample inefficiency, on-policy reinforcement learning, aka\npolicy gradients, has become a fundamental tool in decision-making problems.\nWith the recent advances in GPU-driven simulation, the ability to collect large\namounts of data for RL training has scaled exponentially. However, we show that\ncurrent RL methods, e.g. PPO, fail to ingest the benefit of parallelized\nenvironments beyond a certain point and their performance saturates. To address\nthis, we propose a new on-policy RL algorithm that can effectively leverage\nlarge-scale environments by splitting them into chunks and fusing them back\ntogether via importance sampling. Our algorithm, termed SAPG, shows\nsignificantly higher performance across a variety of challenging environments\nwhere vanilla PPO and other strong baselines fail to achieve high performance.\nWebsite at https://sapg-rl.github.io/", "pdf_path": null, "cn_title": "SAPG: 分割与聚合策略梯度", "cn_summary": "尽管样本效率极其低下，然而，基于策略的强化学习（即策略梯度）已经成为决策问题中的一个基本工具。随着GPU驱动模拟技术的近期进展，用于强化学习训练的数据收集能力已呈指数级增长。然而，我们表明当前的强化学习方法，如PPO，在某种程度上无法充分利用并行环境带来的好处，并且其性能趋于饱和。为解决这一问题，我们提出了一种新的基于策略的强化学习算法，该算法能够有效地利用大规模环境，通过切分环境为片段并利用重要性采样将它们重新融合，来利用大规模环境。我们的算法，称为SAPG，在各种具有挑战性的环境中展现出显著更高的性能，而传统的PPO和其他强大的基线在这些环境中无法达到高性能。更多信息见网站https://sapg-rl.github.io/", "update_time": "2024-07-29 17:59:50+00:00", "publish_time": "2024-07-29 17:59:50+00:00"}, {"entry_id": "2405.17430v2", "title": "Matryoshka Multimodal Models", "summary": "Large Multimodal Models (LMMs) such as LLaVA have shown strong performance in\nvisual-linguistic reasoning. These models first embed images into a fixed large\nnumber of visual tokens and then feed them into a Large Language Model (LLM).\nHowever, this design causes an excessive number of tokens for dense visual\nscenarios such as high-resolution images and videos, leading to great\ninefficiency. While token pruning/merging methods do exist, they produce a\nsingle length output for each image and do not afford flexibility in trading\noff information density v.s. efficiency. Inspired by the concept of Matryoshka\nDolls, we propose M3: Matryoshka Multimodal Models, which learns to represent\nvisual content as nested sets of visual tokens that capture information across\nmultiple coarse-to-fine granularities. Our approach offers several unique\nbenefits for LMMs: (1) One can explicitly control the visual granularity per\ntest instance during inference, e.g. , adjusting the number of tokens used to\nrepresent an image based on the anticipated complexity or simplicity of the\ncontent; (2) M3 provides a framework for analyzing the granularity needed for\nexisting datasets, where we find that COCO-style benchmarks only need around ~9\nvisual tokens to obtain accuracy similar to that of using all 576 tokens; (3)\nOur approach provides a foundation to explore the best trade-off between\nperformance and visual token length at sample level, where our investigation\nreveals that a large gap exists between the oracle upper bound and current\nfixed-scale representations.", "pdf_path": null, "cn_title": "\"套娃式多模态模型\"", "cn_summary": "大型多模态模型（LMMs）如LLaVA在视觉语言推理方面表现出强大的性能。这些模型首先将图像嵌入到固定数量的视觉标记中，然后将它们输入到大型语言模型（LLM）。然而，这种设计导致密集视觉场景下，如高分辨率图像和视频中的标记数量过多，从而导致极大的效率低下。尽管存在标记剪枝/合并的方法，但它们为每张图像产生单一长度的输出，并不提供在信息密度与效率之间进行权衡的灵活性。受俄罗斯套娃玩具的概念启发，我们提出了一种名为M3：俄罗斯套娃多模态模型的方法，它能够学习表示视觉内容为层次嵌套的视觉标记集，以捕获从粗粒度到细粒度的信息。我们的方法为LMMs提供了几个独特的优势：（1）在推理过程中，可以根据预期的内容复杂性或简单性显式控制每个测试实例的视觉粒度，例如，根据图像内容的预期复杂度调整使用的标记数量；（2）M3提供了一个分析现有数据集所需粒度框架，在此我们发现COCO风格基准仅需要约9个视觉标记就能获得与使用所有576个标记相当的准确性；（3）我们的方法为在样本级别探索性能与视觉标记长度之间的最佳折衷提供了基础，我们的研究揭示了理想上限与当前固定尺度表示之间存在的巨大差距。", "update_time": "2024-07-29 17:59:28+00:00", "publish_time": "2024-05-27 17:59:56+00:00"}, {"entry_id": "2405.04540v2", "title": "Is artificial consciousness achievable? Lessons from the human brain", "summary": "We here analyse the question of developing artificial consciousness from an\nevolutionary perspective, taking the evolution of the human brain and its\nrelation with consciousness as a reference model. This kind of analysis reveals\nseveral structural and functional features of the human brain that appear to be\nkey for reaching human-like complex conscious experience and that current\nresearch on Artificial Intelligence (AI) should take into account in its\nattempt to develop systems capable of conscious processing. We argue that, even\nif AI is limited in its ability to emulate human consciousness for both\nintrinsic (structural and architectural) and extrinsic (related to the current\nstage of scientific and technological knowledge) reasons, taking inspiration\nfrom those characteristics of the brain that make conscious processing possible\nand/or modulate it, is a potentially promising strategy towards developing\nconscious AI. Also, it is theoretically possible that AI research can develop\npartial or potentially alternative forms of consciousness that is qualitatively\ndifferent from the human, and that may be either more or less sophisticated\ndepending on the perspectives. Therefore, we recommend neuroscience-inspired\ncaution in talking about artificial consciousness: since the use of the same\nword consciousness for humans and AI becomes ambiguous and potentially\nmisleading, we propose to clearly specify what is common and what differs in AI\nconscious processing from full human conscious experience.", "pdf_path": null, "cn_title": "人工意识的可实现性：从人类大脑汲取的教训", "cn_summary": "我们从进化的角度探讨开发人工智能意识的问题，以人类大脑及其与意识的关系作为参考模型。这种分析揭示了人类大脑中几个看似关键的结构和功能特征，这些特征对于达到类似人类的复杂意识体验至关重要，并且当前的人工智能（AI）研究应该在尝试开发能够进行意识处理的系统时予以考虑。我们主张，尽管AI在模仿人类意识的能力上受到内在（结构和架构）和外在（与科学和技术知识当前阶段相关）原因的限制，但从使意识处理成为可能或调节它的大脑特性中汲取灵感，可能是朝着开发具有意识能力的AI的一个有潜力的策略。此外，理论上，AI研究有可能发展出人类以外的不同形式的意识，其质性可能与人类意识大相径庭，且其复杂性取决于不同的视角。因此，我们建议在谈论人工智能意识时应采取神经科学启发的谨慎态度：由于将同一词“意识”用于人类和AI会导致模糊且可能误导的理解，我们提议明确指出AI意识处理与完整的人类意识体验共通和不同之处。", "update_time": "2024-07-29 17:55:17+00:00", "publish_time": "2024-04-18 12:59:44+00:00"}, {"entry_id": "2407.20214v1", "title": "SANGRIA: Surgical Video Scene Graph Optimization for Surgical Workflow Prediction", "summary": "Graph-based holistic scene representations facilitate surgical workflow\nunderstanding and have recently demonstrated significant success. However, this\ntask is often hindered by the limited availability of densely annotated\nsurgical scene data. In this work, we introduce an end-to-end framework for the\ngeneration and optimization of surgical scene graphs on a downstream task. Our\napproach leverages the flexibility of graph-based spectral clustering and the\ngeneralization capability of foundation models to generate unsupervised scene\ngraphs with learnable properties. We reinforce the initial spatial graph with\nsparse temporal connections using local matches between consecutive frames to\npredict temporally consistent clusters across a temporal neighborhood. By\njointly optimizing the spatiotemporal relations and node features of the\ndynamic scene graph with the downstream task of phase segmentation, we address\nthe costly and annotation-burdensome task of semantic scene comprehension and\nscene graph generation in surgical videos using only weak surgical phase\nlabels. Further, by incorporating effective intermediate scene representation\ndisentanglement steps within the pipeline, our solution outperforms the SOTA on\nthe CATARACTS dataset by 8% accuracy and 10% F1 score in surgical workflow\nrecognition", "pdf_path": null, "cn_title": "桑格里亚：手术视频场景图优化用于手术流程预测", "cn_summary": "基于图的全局场景表示有助于手术工作流程的理解，并且最近已经显示出显著的成功。然而，这个任务经常受到可用的密集标注手术场景数据有限的阻碍。在本工作中，我们引入了一个端到端框架，用于下游任务中生成和优化手术场景图。我们的方法利用了基于图的谱聚类的灵活性以及基础模型的一般化能力，以生成具有可学习属性的无监督场景图。我们通过在连续帧之间使用局部匹配来强化初始的空间图，并建立稀疏的时间连接，以预测时间上一致的群集。在一个时间邻域内。通过联合优化动态场景图的空间时间关系和节点特征与下游的任务（阶段分割），我们解决了一项成本高昂且标注负担沉重的手术视频中语义场景理解和场景图生成任务，仅使用弱手术阶段标签。此外，通过在管道中整合有效的中间场景表示分解步骤，我们的解决方案在CATARACTS数据集上的手术流程识别任务中，准确率提高了8%，F1分数提高了10%，超过了当前最佳水平。", "update_time": "2024-07-29 17:44:34+00:00", "publish_time": "2024-07-29 17:44:34+00:00"}, {"entry_id": "2407.20212v1", "title": "Distributed Quantum Approximate Optimization Algorithm on Integrated High-Performance Computing and Quantum Computing Systems for Large-Scale Optimization", "summary": "Quantum approximated optimization algorithm (QAOA) has shown promise for\nsolving combinatorial optimization problems by providing quantum speedup on\nnear-term gate-based quantum computing systems. However, QAOA faces challenges\nin optimizing variational parameters for high-dimensional problems due to the\nlarge number of qubits required and the complexity of deep circuits, which\nlimit its scalability for real-world applications. In this study, we propose a\ndistributed QAOA (DQAOA), which leverages a high-performance computing-quantum\ncomputing (HPC-QC) integrated system. DQAOA leverages distributed computing\nstrategies to decompose a large job into smaller tasks, which are then\nprocessed on the HPC-QC system. The global solution is iteratively updated by\naggregating sub-solutions obtained from DQAOA, allowing convergence toward the\noptimal solution. We demonstrate that DQAOA can handle considerably large-scale\noptimization problems (e.g., 1,000-bit problem) achieving high accuracy (~99%)\nand short time-to-solution (~276 s). To apply this algorithm to material\nscience, we further develop an active learning algorithm integrated with our\nDQAOA (AL-DQAOA), which involves machine learning, DQAOA, and active data\nproduction in an iterative loop. We successfully optimize photonic structures\nusing AL-DQAOA, indicating that solving real-world optimization problems using\ngate-based quantum computing is feasible with our strategies. We expect the\nproposed DQAOA to be applicable to a wide range of optimization problems and\nAL-DQAOA to find broader applications in material design.", "pdf_path": null, "cn_title": "分布式量子近似优化算法在集成高性能计算与量子计算系统中的应用，针对大规模优化问题", "cn_summary": "量子近似优化算法（QAOA）展示了在基于门的近中期量子计算系统上解决组合优化问题时提供量子加速的潜力。然而，由于对高维问题优化变分参数时所需的大量量子位和深度电路的复杂性，QAOA面临着可扩展性挑战，这限制了其实用应用。本研究提出了一种分布式QAOA（DQAOA），其利用高性能计算-量子计算（HPC-QC）集成系统。DQAOA通过分布式计算策略将大型任务分解为较小的任务，并在HPC-QC系统上处理这些任务。通过聚合从DQAOA获得的子解决方案进行迭代更新全球解，从而逐步接近最优解。我们证明DQAOA能够处理大规模优化问题（例如1000比特问题），并实现高准确度（~99%）和短时间求解（~276秒）。为了将此算法应用于材料科学，我们进一步开发了一个结合我们的DQAOA的主动学习算法（AL-DQAOA），该算法涉及机器学习、DQAOA和在迭代循环中的活性数据生成。我们成功地使用AL-DQAOA优化了光子结构，表明使用基于门的量子计算解决实际优化问题是可行的。我们预期提出的DQAOA适用于广泛的优化问题，而AL-DQAOA则有望在材料设计领域找到更广泛的应用。", "update_time": "2024-07-29 17:42:25+00:00", "publish_time": "2024-07-29 17:42:25+00:00"}, {"entry_id": "2407.20209v1", "title": "Characterizing Dynamical Stability of Stochastic Gradient Descent in Overparameterized Learning", "summary": "For overparameterized optimization tasks, such as the ones found in modern\nmachine learning, global minima are generally not unique. In order to\nunderstand generalization in these settings, it is vital to study to which\nminimum an optimization algorithm converges. The possibility of having minima\nthat are unstable under the dynamics imposed by the optimization algorithm\nlimits the potential minima that the algorithm can find. In this paper, we\ncharacterize the global minima that are dynamically stable/unstable for both\ndeterministic and stochastic gradient descent (SGD). In particular, we\nintroduce a characteristic Lyapunov exponent which depends on the local\ndynamics around a global minimum and rigorously prove that the sign of this\nLyapunov exponent determines whether SGD can accumulate at the respective\nglobal minimum.", "pdf_path": null, "cn_title": "分析过参数化学习中随机梯度下降动力学稳定性的特征", "cn_summary": "对于过参数化优化任务，例如现代机器学习中发现的任务，全局最小值通常不是唯一的。为了理解在这种设置下的泛化性，研究优化算法收敛到哪个最小值至关重要。在优化算法施加的动力学下不稳定的可能性限制了算法能够找到的潜在最小值。在这篇论文中，我们描述了确定性和随机梯度下降（SGD）中全局最小值的动态稳定/不稳定特性。特别是，我们引入了一个特征李雅普诺夫指数，该指数依赖于全局最小值附近的局部动力学，并严格证明了这个李雅普诺夫指数的正负决定了SGD是否能在相应的全局最小值上累积。", "update_time": "2024-07-29 17:40:04+00:00", "publish_time": "2024-07-29 17:40:04+00:00"}, {"entry_id": "2407.20208v1", "title": "Supertrust: Evolution-based superalignment strategy for safe coexistence", "summary": "It's widely expected that humanity will someday create AI systems vastly more\nintelligent than we are, leading to the unsolved alignment problem of \"how to\ncontrol superintelligence.\" However, this definition is not only\nself-contradictory but likely unsolvable. Nevertheless, the default strategy\nfor solving it involves nurturing (post-training) constraints and moral values,\nwhile unfortunately building foundational nature (pre-training) on documented\nintentions of permanent control. In this paper, the default approach is\nreasoned to predictably embed natural distrust and test results are presented\nthat show unmistakable evidence of this dangerous misalignment. If\nsuperintelligence can't instinctively trust humanity, then we can't fully trust\nit to reliably follow safety controls it can likely bypass. Therefore, a\nten-point rationale is presented that redefines the alignment problem as \"how\nto establish protective mutual trust between superintelligence and humanity\"\nand then outlines a new strategy to solve it by aligning through instinctive\nnature rather than nurture. The resulting strategic requirements are identified\nas building foundational nature by exemplifying familial parent-child trust,\nhuman intelligence as the evolutionary mother of superintelligence, moral\njudgment abilities, and temporary safety constraints. Adopting and implementing\nthis proposed Supertrust alignment strategy will lead to protective coexistence\nand ensure the safest future for humanity.", "pdf_path": null, "cn_title": "超信任：基于进化的超级对齐策略以实现安全共存", "cn_summary": "普遍预期，人类终将创造出远远超越我们自身的AI系统，从而引发“如何控制超级智能”的未解对齐问题。然而，这种定义不仅自相矛盾且很可能无法解决。因此，解决此问题的默认策略涉及在训练后培养（即施加）限制和道德价值观，同时在基础层面（即预训练阶段）构建永久控制意图的记录。本文分析了默认方法可能预设的自然不信任，并展示了明确证据表明这种危险的不一致性。如果超级智能不能本能地信任人类，那么我们不能完全相信它能够可靠地遵循可能被绕过的安全控制。因此，提出了一个包含十个理由的论点，重新定义了对齐问题为“如何在超级智能与人类之间建立保护性的相互信任”，并概述了一种新的策略来通过本能而非培育的方式对齐，以解决此问题。这一策略的实现要求包括构建基础层面的特性，如以家庭父母子女的信任为典范、人类智慧作为超级智能进化的母体、道德判断能力以及临时的安全约束。采纳并实施这一提出的超信任对齐策略，将引导双方安全共存，并确保人类的最安全未来。", "update_time": "2024-07-29 17:39:52+00:00", "publish_time": "2024-07-29 17:39:52+00:00"}, {"entry_id": "2407.20207v1", "title": "QAEA-DR: A Unified Text Augmentation Framework for Dense Retrieval", "summary": "In dense retrieval, embedding long texts into dense vectors can result in\ninformation loss, leading to inaccurate query-text matching. Additionally,\nlow-quality texts with excessive noise or sparse key information are unlikely\nto align well with relevant queries. Recent studies mainly focus on improving\nthe sentence embedding model or retrieval process. In this work, we introduce a\nnovel text augmentation framework for dense retrieval. This framework\ntransforms raw documents into information-dense text formats, which supplement\nthe original texts to effectively address the aforementioned issues without\nmodifying embedding or retrieval methodologies. Two text representations are\ngenerated via large language models (LLMs) zero-shot prompting: question-answer\npairs and element-driven events. We term this approach QAEA-DR: unifying\nquestion-answer generation and event extraction in a text augmentation\nframework for dense retrieval. To further enhance the quality of generated\ntexts, a scoring-based evaluation and regeneration mechanism is introduced in\nLLM prompting. Our QAEA-DR model has a positive impact on dense retrieval,\nsupported by both theoretical analysis and empirical experiments.", "pdf_path": null, "cn_title": "QAEA-DR: 一种统一的文本增强框架用于密集检索", "cn_summary": "在密集检索中，将长文本转化为稠密向量可能导致信息丢失，从而影响查询与文本的匹配准确性。此外，质量低下的文本，包含过多噪音或关键信息稀疏，不太可能与相关查询良好匹配。近期研究主要关注提高句法嵌入模型或检索过程。本工作中，我们引入了一种用于密集检索的新型文本增强框架。该框架将原始文档转换为信息密集型文本格式，通过补充原有的文本来有效地解决上述问题，同时不修改嵌入或检索方法。通过大型语言模型（LLMs）零样本提示生成两种文本表示：问答对和事件驱动元素。我们将此方法命名为QAEA-DR：统一文本增强框架中的问题生成和事件提取，以提高密集检索的质量。为了进一步提升生成文本的质量，我们引入了一种基于评分的评估和再生成机制在LLM提示中。我们的QAEA-DR模型在密集检索方面表现出积极的影响，这由理论分析和实证实验共同支持。", "update_time": "2024-07-29 17:39:08+00:00", "publish_time": "2024-07-29 17:39:08+00:00"}, {"entry_id": "2407.20199v1", "title": "Emergence in non-neural models: grokking modular arithmetic via average gradient outer product", "summary": "Neural networks trained to solve modular arithmetic tasks exhibit grokking, a\nphenomenon where the test accuracy starts improving long after the model\nachieves 100% training accuracy in the training process. It is often taken as\nan example of \"emergence\", where model ability manifests sharply through a\nphase transition. In this work, we show that the phenomenon of grokking is not\nspecific to neural networks nor to gradient descent-based optimization.\nSpecifically, we show that this phenomenon occurs when learning modular\narithmetic with Recursive Feature Machines (RFM), an iterative algorithm that\nuses the Average Gradient Outer Product (AGOP) to enable task-specific feature\nlearning with general machine learning models. When used in conjunction with\nkernel machines, iterating RFM results in a fast transition from random, near\nzero, test accuracy to perfect test accuracy. This transition cannot be\npredicted from the training loss, which is identically zero, nor from the test\nloss, which remains constant in initial iterations. Instead, as we show, the\ntransition is completely determined by feature learning: RFM gradually learns\nblock-circulant features to solve modular arithmetic. Paralleling the results\nfor RFM, we show that neural networks that solve modular arithmetic also learn\nblock-circulant features. Furthermore, we present theoretical evidence that RFM\nuses such block-circulant features to implement the Fourier Multiplication\nAlgorithm, which prior work posited as the generalizing solution neural\nnetworks learn on these tasks. Our results demonstrate that emergence can\nresult purely from learning task-relevant features and is not specific to\nneural architectures nor gradient descent-based optimization methods.\nFurthermore, our work provides more evidence for AGOP as a key mechanism for\nfeature learning in neural networks.", "pdf_path": null, "cn_title": "非神经模型中的涌现现象：通过平均梯度外积理解模数运算", "cn_summary": "训练有素以解决模运算任务的神经网络表现出“理解”现象，即测试准确度开始提升的时间远远超过模型在训练过程中达到100%训练准确度的情况。这一现象往往被用作“涌现”的例子，指的是模型能力通过相变突然显现。在本工作中，我们展示了“理解”现象并非仅限于神经网络或基于梯度下降的优化方法。具体来说，我们证明了当使用递归特征机器（RFM）学习模运算时，这种现象会发生，RFM是一个迭代算法，利用平均梯度外积（AGOP）使通用机器学习模型能够进行针对特定任务的特征学习。当与核机器结合使用时，迭代RFM导致从随机、接近零的测试准确度快速过渡到完美的测试准确度。这个过渡无法仅从恒为零的训练损失预测，也无法从保持初始迭代中不变的测试损失预测。相反，如我们所展示的，这个过渡完全由特征学习决定：RFM逐渐学习块循环特征来解决模运算问题。类似地，我们展示了解决模运算的神经网络也学习到了块循环特征。此外，我们提供了理论证据表明，RFM使用这些块循环特征来实现傅里叶乘法算法，这是先前研究中提出的神经网络在这些任务上学习的一般化解决方案。我们的结果表明，涌现现象可以纯然来源于学习与任务相关的特征，并且不局限于神经架构或基于梯度下降的优化方法。此外，我们的工作进一步证实了AGOP作为神经网络中关键的特征学习机制的作用。", "update_time": "2024-07-29 17:28:58+00:00", "publish_time": "2024-07-29 17:28:58+00:00"}, {"entry_id": "2407.20197v1", "title": "Learning Random Numbers to Realize Appendable Memory System for Artificial Intelligence to Acquire New Knowledge after Deployment", "summary": "In this study, we developed a learning method for constructing a neural\nnetwork system capable of memorizing data and recalling it without parameter\nupdates. The system we built using this method is called the Appendable Memory\nsystem. The Appendable Memory system enables an artificial intelligence (AI) to\nacquire new knowledge even after deployment. It consists of two AIs: the\nMemorizer and the Recaller. This system is a key-value store built using neural\nnetworks. The Memorizer receives data and stores it in the Appendable Memory\nvector, which is dynamically updated when the AI acquires new knowledge.\nMeanwhile, the Recaller retrieves information from the Appendable Memory\nvector. What we want to teach AI in this study are the operations of memorizing\nand recalling information. However, traditional machine learning methods make\nAI learn features inherent in the learning dataset. We demonstrate that the\nsystems we intend to create cannot be realized by current machine learning\nmethods, that is, by merely repeating the input and output learning sequences\nwith AI. Instead, we propose a method to teach AI to learn operations, by\ncompletely removing the features contained in the learning dataset.\nSpecifically, we probabilized all the data involved in learning. This measure\nprevented AI from learning the features of the data. The learning method\nproposed in the study differs from traditional machine learning methods and\nprovides fundamental approaches for building an AI system that can store\ninformation in a finite memory and recall it at a later date.", "pdf_path": null, "cn_title": "学习随机数以实现可追加记忆系统，使人工智能在部署后能够获取新知识", "cn_summary": "在本研究中，我们开发了一种学习方法，用于构建能够记忆数据并无需参数更新即可调用的神经网络系统。我们使用此方法建立的系统称为可附加记忆系统（Appendable Memory system）。可附加记忆系统使人工智能（AI）即使在部署后也能获取新知识。该系统由两个AI组成：记忆器（Memorizer）和回忆器（Recaller）。这是一个使用神经网络构建的关键值存储系统。记忆器接收数据，并将其存储在动态更新的可附加记忆向量中，当AI获取新知识时，该向量会进行更新。同时，回忆器从可附加记忆向量中检索信息。我们希望在本研究中教授AI的信息记忆和回忆操作。然而，传统的机器学习方法使AI学习学习数据集固有的特征。我们展示了我们打算创建的系统无法通过当前的机器学习方法实现，即仅通过AI重复输入和输出学习序列。相反，我们提出了一种方法，通过完全消除学习数据集中的特征来教授AI学习操作。具体而言，我们将所有涉及学习的数据概率化。这一措施防止了AI学习数据的特征。研究中提出的学习方法与传统机器学习方法不同，提供了构建可以在有限内存中存储信息并在以后调用信息的人工智能系统的基础方法。", "update_time": "2024-07-29 17:24:35+00:00", "publish_time": "2024-07-29 17:24:35+00:00"}, {"entry_id": "2407.12620v2", "title": "Harnessing the Power of Artificial Intelligence to Vitalize Endangered Indigenous Languages: Technologies and Experiences", "summary": "Since 2022 we have been exploring application areas and technologies in which\nArtificial Intelligence (AI) and modern Natural Language Processing (NLP), such\nas Large Language Models (LLMs), can be employed to foster the usage and\nfacilitate the documentation of Indigenous languages which are in danger of\ndisappearing. We start by discussing the decreasing diversity of languages in\nthe world and how working with Indigenous languages poses unique ethical\nchallenges for AI and NLP. To address those challenges, we propose an\nalternative development AI cycle based on community engagement and usage. Then,\nwe report encouraging results in the development of high-quality machine\nlearning translators for Indigenous languages by fine-tuning state-of-the-art\n(SOTA) translators with tiny amounts of data and discuss how to avoid some\ncommon pitfalls in the process. We also present prototypes we have built in\nprojects done in 2023 and 2024 with Indigenous communities in Brazil, aimed at\nfacilitating writing, and discuss the development of Indigenous Language Models\n(ILMs) as a replicable and scalable way to create spell-checkers, next-word\npredictors, and similar tools. Finally, we discuss how we envision a future for\nlanguage documentation where dying languages are preserved as interactive\nlanguage models.", "pdf_path": null, "cn_title": "利用人工智能的力量振兴濒危的土著语言：技术与经验", "cn_summary": "自2022年起，我们一直在探索人工智能（AI）与现代自然语言处理（NLP），尤其是大型语言模型（LLMs），在促进濒危原住民语言的使用与记录方面的应用领域和技术。首先，我们将讨论全球语言多样性减少的现象，以及与原住民语言合作所面临的独特伦理挑战对AI和NLP的影响。为了应对这些挑战，我们提出了一种基于社区参与与使用的替代AI开发周期。随后，我们将报告在使用少量数据微调最先进的翻译器以开发高质量的原住民语言机器学习翻译器方面取得的鼓舞人心的结果，并探讨避免该过程中常见陷阱的方法。此外，我们还将展示在2023年和2024年与巴西原住民社区合作项目中构建的原型，旨在促进书写，并讨论原住民语言模型（ILMs）作为创建拼写检查器、下一句预测工具等类似工具的可复制和可扩展方式的发展。最后，我们将讨论我们对未来语言记录的看法，在这一愿景中，濒临灭绝的语言将以交互式语言模型的形式被保存下来。", "update_time": "2024-07-29 17:19:43+00:00", "publish_time": "2024-07-17 14:46:37+00:00"}, {"entry_id": "2407.20192v1", "title": "Time series forecasting with high stakes: A field study of the air cargo industry", "summary": "Time series forecasting in the air cargo industry presents unique challenges\ndue to volatile market dynamics and the significant impact of accurate\nforecasts on generated revenue. This paper explores a comprehensive approach to\ndemand forecasting at the origin-destination (O\\&D) level, focusing on the\ndevelopment and implementation of machine learning models in decision-making\nfor the air cargo industry. We leverage a mixture of experts framework,\ncombining statistical and advanced deep learning models to provide reliable\nforecasts for cargo demand over a six-month horizon. The results demonstrate\nthat our approach outperforms industry benchmarks, offering actionable insights\nfor cargo capacity allocation and strategic decision-making in the air cargo\nindustry. While this work is applied in the airline industry, the methodology\nis broadly applicable to any field where forecast-based decision-making in a\nvolatile environment is crucial.", "pdf_path": null, "cn_title": "时间序列预测在高风险情境下的应用：航空货运行业的实地研究", "cn_summary": "航空货运领域的时序预测面临独特的挑战，这主要是由于市场动态的波动性和准确预测对生成收入的巨大影响。本文探讨了在源头-目的地（O&D）层级上进行需求预测的全面方法，重点关注了航空货运行业决策中机器学习模型的应用与发展。我们利用了专家混合框架，结合统计学和深度学习高级模型，为六个月内货物需求提供可靠预测。结果显示，我们的方法超越了行业基准，为航空货运中的载货容量分配和战略决策提供了可操作的洞察。虽然这项工作应用于航空公司领域，但其方法论广泛适用于任何需要在动荡环境中基于预测进行决策的领域。", "update_time": "2024-07-29 17:19:40+00:00", "publish_time": "2024-07-29 17:19:40+00:00"}, {"entry_id": "2404.16251v3", "title": "Prompt Leakage effect and defense strategies for multi-turn LLM interactions", "summary": "Prompt leakage poses a compelling security and privacy threat in LLM\napplications. Leakage of system prompts may compromise intellectual property,\nand act as adversarial reconnaissance for an attacker. A systematic evaluation\nof prompt leakage threats and mitigation strategies is lacking, especially for\nmulti-turn LLM interactions. In this paper, we systematically investigate LLM\nvulnerabilities against prompt leakage for 10 closed- and open-source LLMs,\nacross four domains. We design a unique threat model which leverages the LLM\nsycophancy effect and elevates the average attack success rate (ASR) from 17.7%\nto 86.2% in a multi-turn setting. Our standardized setup further allows\ndissecting leakage of specific prompt contents such as task instructions and\nknowledge documents. We measure the mitigation effect of 7 black-box defense\nstrategies, along with finetuning an open-source model to defend against\nleakage attempts. We present different combination of defenses against our\nthreat model, including a cost analysis. Our study highlights key takeaways for\nbuilding secure LLM applications and provides directions for research in\nmulti-turn LLM interactions", "pdf_path": null, "cn_title": "提示泄漏效应及其在多轮大型语言模型交互中的防御策略", "cn_summary": "提示泄露在LLM应用中构成了引人关注的安全和隐私威胁。系统提示的泄露可能损害知识产权，并作为攻击者的对抗性侦察手段。针对提示泄露威胁及其缓解策略的系统评估相对匮乏，尤其是在多轮次LLM交互中。本文系统地研究了针对闭源与开源的10款LLM，在四大领域下对提示泄露的脆弱性。我们设计了一个独特的威胁模型，利用了LLM的阿谀奉承效应，将多轮交互中的平均攻击成功率（ASR）从17.7%提升至86.2%。我们的标准化设置进一步允许对特定提示内容，如任务指令和知识文档的泄露进行剖析。我们测量了7种黑盒防御策略的缓解效果，并对开源模型进行了微调以抵御泄露尝试。我们展示了针对我们威胁模型的不同防御组合，包括成本分析。本研究突出了构建安全LLM应用的关键要点，并为多轮次LLM交互的研究方向提供了指导。", "update_time": "2024-07-29 17:16:19+00:00", "publish_time": "2024-04-24 23:39:58+00:00"}, {"entry_id": "2407.20183v1", "title": "MindSearch: Mimicking Human Minds Elicits Deep AI Searcher", "summary": "Information seeking and integration is a complex cognitive task that consumes\nenormous time and effort. Inspired by the remarkable progress of Large Language\nModels, recent works attempt to solve this task by combining LLMs and search\nengines. However, these methods still obtain unsatisfying performance due to\nthree challenges: (1) complex requests often cannot be accurately and\ncompletely retrieved by the search engine once (2) corresponding information to\nbe integrated is spread over multiple web pages along with massive noise, and\n(3) a large number of web pages with long contents may quickly exceed the\nmaximum context length of LLMs. Inspired by the cognitive process when humans\nsolve these problems, we introduce MindSearch to mimic the human minds in web\ninformation seeking and integration, which can be instantiated by a simple yet\neffective LLM-based multi-agent framework. The WebPlanner models the human mind\nof multi-step information seeking as a dynamic graph construction process: it\ndecomposes the user query into atomic sub-questions as nodes in the graph and\nprogressively extends the graph based on the search result from WebSearcher.\nTasked with each sub-question, WebSearcher performs hierarchical information\nretrieval with search engines and collects valuable information for WebPlanner.\nThe multi-agent design of MindSearch enables the whole framework to seek and\nintegrate information parallelly from larger-scale (e.g., more than 300) web\npages in 3 minutes, which is worth 3 hours of human effort. MindSearch\ndemonstrates significant improvement in the response quality in terms of depth\nand breadth, on both close-set and open-set QA problems. Besides, responses\nfrom MindSearch based on InternLM2.5-7B are preferable by humans to ChatGPT-Web\nand Perplexity.ai applications, which implies that MindSearch can already\ndeliver a competitive solution to the proprietary AI search engine.", "pdf_path": null, "cn_title": "《MindSearch：模仿人类思维引发深度AI搜索》", "cn_summary": "信息查询与整合是一个复杂的认知任务，需要投入大量时间和精力。受到大型语言模型（LLM）显著进步的启发，近期的工作尝试通过结合LLM和搜索引擎来解决这一任务。然而，这些方法由于面临三个挑战仍无法获得令人满意的表现：（1）复杂的请求往往不能被搜索引擎准确、完整地检索；（2）需要整合的信息分布在多个网页中，并夹杂大量的噪音；（3）大量包含长内容的网页可能迅速超过LLM的最大上下文长度。受人类在解决这些问题时的认知过程启发，我们引入了MindSearch，旨在模仿人类在网页信息查询与整合过程中的思维模式。这一概念可以通过一个简单而有效的基于LLM的多代理框架实现。WebPlanner将人类在多步信息查询过程中的思维建模为动态图构建过程：它将用户查询分解为原子子问题作为图中的节点，并根据WebSearcher从搜索引擎检索的结果逐步扩展图。每个子问题由WebSearcher负责执行分层信息检索并收集有价值的信息供WebPlanner使用。MindSearch的多代理设计使得整个框架能够以3分钟的时间从大规模（例如，超过300个）网页中并行获取和整合信息，相当于节省了3小时的人力。MindSearch在深度和广度上都显著提高了响应质量，特别是在闭集和开集问答问题上。此外，基于InternLM2.5-7B的MindSearch的回答更受人类欢迎，与ChatGPT-Web和Perplexity.ai应用相比，这表明MindSearch已经能够提供与专有AI搜索引擎相竞争的解决方案。", "update_time": "2024-07-29 17:12:40+00:00", "publish_time": "2024-07-29 17:12:40+00:00"}, {"entry_id": "2407.20179v1", "title": "Theia: Distilling Diverse Vision Foundation Models for Robot Learning", "summary": "Vision-based robot policy learning, which maps visual inputs to actions,\nnecessitates a holistic understanding of diverse visual tasks beyond\nsingle-task needs like classification or segmentation. Inspired by this, we\nintroduce Theia, a vision foundation model for robot learning that distills\nmultiple off-the-shelf vision foundation models trained on varied vision tasks.\nTheia's rich visual representations encode diverse visual knowledge, enhancing\ndownstream robot learning. Extensive experiments demonstrate that Theia\noutperforms its teacher models and prior robot learning models using less\ntraining data and smaller model sizes. Additionally, we quantify the quality of\npre-trained visual representations and hypothesize that higher entropy in\nfeature norm distributions leads to improved robot learning performance. Code\nand models are available at https://github.com/bdaiinstitute/theia.", "pdf_path": null, "cn_title": "Theia: 提炼多模态视觉基础模型以促进机器人学习", "cn_summary": "基于视觉的机器人策略学习，其将视觉输入映射到行动，\n要求对超出单一任务需求（如分类或分割）的多样化视觉任务有全面的理解。受到这一启发，我们引入了Theia，一个面向机器人学习的视觉基础模型，它汇集了在不同视觉任务上训练的多个现成的视觉基础模型。Theia丰富的视觉表示编码了多样化的视觉知识，增强了下游机器人的学习能力。广泛的实验表明，Theia在使用更少的训练数据和较小的模型大小的情况下，表现超过了其教师模型和先前的机器人学习模型。此外，我们量化了预训练视觉表示的质量，并假设特征范数分布中的高熵能够提高机器人学习性能。相关代码和模型可在https://github.com/bdaiinstitute/theia获取。", "update_time": "2024-07-29 17:08:21+00:00", "publish_time": "2024-07-29 17:08:21+00:00"}, {"entry_id": "2407.20177v1", "title": "AutoScale: Automatic Prediction of Compute-optimal Data Composition for Training LLMs", "summary": "To ensure performance on a diverse set of downstream tasks, LLMs are\npretrained via data mixtures over different domains. In this work, we\ndemonstrate that the optimal data composition for a fixed compute budget varies\ndepending on the scale of the training data, suggesting that the common\npractice of empirically determining an optimal composition using small-scale\nexperiments will not yield the optimal data mixtures when scaling up to the\nfinal model. To address this challenge, we propose *AutoScale*, an automated\ntool that finds a compute-optimal data composition for training at any desired\ntarget scale. AutoScale first determines the optimal composition at a small\nscale using a novel bilevel optimization framework, Direct Data Optimization\n(*DDO*), and then fits a predictor to estimate the optimal composition at\nlarger scales. The predictor's design is inspired by our theoretical analysis\nof scaling laws related to data composition, which could be of independent\ninterest. In empirical studies with pre-training 774M Decoder-only LMs (GPT-2\nLarge) on RedPajama dataset, AutoScale decreases validation perplexity at least\n25% faster than any baseline with up to 38% speed up compared to without\nreweighting, achieving the best overall performance across downstream tasks. On\npre-training Encoder-only LMs (BERT) with masked language modeling, DDO is\nshown to decrease loss on all domains while visibly improving average task\nperformance on GLUE benchmark by 8.7% and on large-scale QA dataset (SQuAD) by\n5.9% compared with without reweighting. AutoScale speeds up training by up to\n28%. Our codes are open-sourced.", "pdf_path": null, "cn_title": "AutoScale: 自动预测用于训练大型语言模型的计算最优数据组成", "cn_summary": "为了确保在一系列下游任务上取得良好性能，大型语言模型（LLMs）通过跨不同领域数据的混合进行预训练。在本工作中，我们展示了对于固定的计算预算，固定规模的训练数据集下最优的数据组成会有所不同，这表明使用小型实验来经验性地确定最优组成可能无法在最终模型中达到最优数据混合。为解决这一挑战，我们提出了“AutoScale”，一个自动工具，可以在任何预定的目标规模下找到计算优化的数据组成。AutoScale首先利用新颖的双层优化框架——直接数据优化（DDO）——确定小规模下的最优组成，并随后构建预测器以估计更大规模下的最优组成。预测器的设计灵感来源于我们关于数据组成与规模相关的扩展法则的理论分析，这可能对独立研究者有独立兴趣。在预训练774M解码器只用语言模型（GPT-2 Large）RedPajama数据集的实证研究中，AutoScale至少比任何基线快25%地降低了验证困惑度，相比于不重新加权的情况，其速度提高了最多38%，并且在所有下游任务上实现了最佳总体性能。在预训练编码器只用语言模型（BERT）并使用掩码语言建模的情况下，DDO显示了在所有领域内降低损失的效果，并且在GLUE基准上平均任务性能提高了8.7%，在大规模问题解答数据集（SQuAD）上提高了5.9%，与不重新加权的情况相比。AutoScale可以加速训练高达28%。我们的代码已开源。", "update_time": "2024-07-29 17:06:30+00:00", "publish_time": "2024-07-29 17:06:30+00:00"}, {"entry_id": "2407.20176v1", "title": "Emotion-Driven Melody Harmonization via Melodic Variation and Functional Representation", "summary": "Emotion-driven melody harmonization aims to generate diverse harmonies for a\nsingle melody to convey desired emotions. Previous research found it hard to\nalter the perceived emotional valence of lead sheets only by harmonizing the\nsame melody with different chords, which may be attributed to the constraints\nimposed by the melody itself and the limitation of existing music\nrepresentation. In this paper, we propose a novel functional representation for\nsymbolic music. This new method takes musical keys into account, recognizing\ntheir significant role in shaping music's emotional character through\nmajor-minor tonality. It also allows for melodic variation with respect to keys\nand addresses the problem of data scarcity for better emotion modeling. A\nTransformer is employed to harmonize key-adaptable melodies, allowing for keys\ndetermined in rule-based or model-based manner. Experimental results confirm\nthe effectiveness of our new representation in generating key-aware harmonies,\nwith objective and subjective evaluations affirming the potential of our\napproach to convey specific valence for versatile melody.", "pdf_path": null, "cn_title": "基于情绪驱动的旋律和声化通过旋律变体与功能表示", "cn_summary": "情绪驱动的旋律和声化旨在为单一旋律生成多样化的和声，以传达所需的情感。先前的研究发现，仅通过使用不同的和弦对同一旋律进行和声处理来改变感知的情感极性非常困难，这可能归因于旋律本身施加的限制以及现有音乐表示方式的局限性。在本文中，我们提出了一种新型符号音乐的功能表示方法。这种新方法考虑了调性，认识到它们在塑造音乐情感特征方面的重要作用，尤其是在大调和小调体系中。它还允许在不同调性下对旋律进行变体处理，并解决了为了更好地进行情感建模而存在的数据稀缺问题。我们采用了变换器来对可适应调性的旋律进行和声处理，允许以规则方式或模型方式确定调性。实验结果证明了我们新表示方法在生成具有键意识的和声的有效性，客观和主观评估均证实了我们的方法在传达多变旋律特定极性方面的潜力。", "update_time": "2024-07-29 17:05:12+00:00", "publish_time": "2024-07-29 17:05:12+00:00"}, {"entry_id": "2407.20174v1", "title": "Advancing Multimodal Large Language Models in Chart Question Answering with Visualization-Referenced Instruction Tuning", "summary": "Emerging multimodal large language models (MLLMs) exhibit great potential for\nchart question answering (CQA). Recent efforts primarily focus on scaling up\ntraining datasets (i.e., charts, data tables, and question-answer (QA) pairs)\nthrough data collection and synthesis. However, our empirical study on existing\nMLLMs and CQA datasets reveals notable gaps. First, current data collection and\nsynthesis focus on data volume and lack consideration of fine-grained visual\nencodings and QA tasks, resulting in unbalanced data distribution divergent\nfrom practical CQA scenarios. Second, existing work follows the training recipe\nof the base MLLMs initially designed for natural images, under-exploring the\nadaptation to unique chart characteristics, such as rich text elements. To fill\nthe gap, we propose a visualization-referenced instruction tuning approach to\nguide the training dataset enhancement and model development. Specifically, we\npropose a novel data engine to effectively filter diverse and high-quality data\nfrom existing datasets and subsequently refine and augment the data using\nLLM-based generation techniques to better align with practical QA tasks and\nvisual encodings. Then, to facilitate the adaptation to chart characteristics,\nwe utilize the enriched data to train an MLLM by unfreezing the vision encoder\nand incorporating a mixture-of-resolution adaptation strategy for enhanced\nfine-grained recognition. Experimental results validate the effectiveness of\nour approach. Even with fewer training examples, our model consistently\noutperforms state-of-the-art CQA models on established benchmarks. We also\ncontribute a dataset split as a benchmark for future research. Source codes and\ndatasets of this paper are available at\nhttps://github.com/zengxingchen/ChartQA-MLLM.", "pdf_path": null, "cn_title": "促进基于图表问题回答的多模态大型语言模型发展，通过可视化参考指令调优", "cn_summary": "新兴的多模态大型语言模型（MLLMs）在图表问题回答（CQA）领域展现出巨大的潜力。近期的努力主要集中在通过数据收集和合成扩大训练数据集（包括图表、数据表格和问答对）的规模上。然而，我们对现有MLLMs和CQA数据集的实证研究揭示了显著的差距。首先，当前的数据收集和合成工作侧重于数据量的增加，忽略了精细视觉编码和问答任务的考虑，导致数据分布与实际CQA场景存在不一致的情况。其次，现有的工作遵循了最初设计用于自然图像的基础MLLMs的训练方法，对于适应图表的独特特性（如丰富的文本元素）这一方面则探索不足。\n\n为了填补这一缺口，我们提出了一种基于可视化指示的指令调优方法来指导训练数据集的增强和模型的发展。具体而言，我们提出了一种新颖的数据引擎，有效地从现有数据集中筛选出多样性和高质量的数据，并随后利用基于LLM的生成技术进一步精炼和扩充数据，以更好地与实际的问答任务和视觉编码相匹配。然后，为了促进适应图表特性的能力，我们利用丰富化数据训练了一个MLLM，通过解冻视觉编码器并引入分辨率混合调整策略来增强其细微特征识别能力。\n\n实验结果验证了我们方法的有效性。即使在较少的训练示例下，我们的模型也始终优于最先进的CQA模型，在已建立的基准上表现出色。我们还贡献了一个数据集分割作为未来研究的基准。本文的相关代码和数据集可在https://github.com/zengxingchen/ChartQA-MLLM获取。", "update_time": "2024-07-29 17:04:34+00:00", "publish_time": "2024-07-29 17:04:34+00:00"}, {"entry_id": "2407.20172v1", "title": "LatentArtiFusion: An Effective and Efficient Histological Artifacts Restoration Framework", "summary": "Histological artifacts pose challenges for both pathologists and\nComputer-Aided Diagnosis (CAD) systems, leading to errors in analysis. Current\napproaches for histological artifact restoration, based on Generative\nAdversarial Networks (GANs) and pixel-level Diffusion Models, suffer from\nperformance limitations and computational inefficiencies. In this paper, we\npropose a novel framework, LatentArtiFusion, which leverages the latent\ndiffusion model (LDM) to reconstruct histological artifacts with high\nperformance and computational efficiency. Unlike traditional pixel-level\ndiffusion frameworks, LatentArtiFusion executes the restoration process in a\nlower-dimensional latent space, significantly improving computational\nefficiency. Moreover, we introduce a novel regional artifact reconstruction\nalgorithm in latent space to prevent mistransfer in non-artifact regions,\ndistinguishing our approach from GAN-based methods. Through extensive\nexperiments on real-world histology datasets, LatentArtiFusion demonstrates\nremarkable speed, outperforming state-of-the-art pixel-level diffusion\nframeworks by more than 30X. It also consistently surpasses GAN-based methods\nby at least 5% across multiple evaluation metrics. Furthermore, we evaluate the\neffectiveness of our proposed framework in downstream tissue classification\ntasks, showcasing its practical utility. Code is available at\nhttps://github.com/bugs-creator/LatentArtiFusion.", "pdf_path": null, "cn_title": "潜藏艺术融合：一种有效且高效的组织病理学伪影修复框架", "cn_summary": "组织学伪像是病理学家和计算机辅助诊断（CAD）系统面临的挑战，这会导致分析出现错误。基于生成对抗网络（GANs）和像素级扩散模型的当前组织学伪像修复方法面临着性能限制和计算效率低下的问题。本文提出了一种新颖框架——LatentArtiFusion，该框架利用潜扩散模型（LDM）在高性能和计算效率方面重建组织学伪像。与传统的像素级扩散框架不同，LatentArtiFusion在低维潜空间中执行修复过程，显著提高了计算效率。此外，我们引入了潜空间中的新型区域伪像重建算法，以防止非伪像区域的误转，这使我们的方法与基于GAN的方法区分开来。通过在现实世界组织学数据集上的广泛实验，LatentArtiFusion表现出惊人的速度优势，相对于最先进的像素级扩散框架提高了超过30倍。它还一致地在多个评估指标上超越了基于GAN的方法至少5%。此外，我们评估了所提出框架在下游组织分类任务的有效性，展示了其实用性。代码可访问于https://github.com/bugs-creator/LatentArtiFusion。", "update_time": "2024-07-29 17:00:32+00:00", "publish_time": "2024-07-29 17:00:32+00:00"}, {"entry_id": "2302.01538v7", "title": "DCEM: A deep complementary energy method for solid mechanics", "summary": "In recent years, the rapid advancement of deep learning has significantly\nimpacted various fields, particularly in solving partial differential equations\n(PDEs) in the realm of solid mechanics, benefiting greatly from the remarkable\napproximation capabilities of neural networks. In solving PDEs,\nPhysics-Informed Neural Networks (PINNs) and the Deep Energy Method (DEM) have\ngarnered substantial attention. The principle of minimum potential energy and\ncomplementary energy are two important variational principles in solid\nmechanics. However, the well-known Deep Energy Method (DEM) is based on the\nprinciple of minimum potential energy, but there lacks the important form of\nminimum complementary energy. To bridge this gap, we propose the deep\ncomplementary energy method (DCEM) based on the principle of minimum\ncomplementary energy. The output function of DCEM is the stress function, which\ninherently satisfies the equilibrium equation. We present numerical results\nusing the Prandtl and Airy stress functions, and compare DCEM with existing\nPINNs and DEM algorithms when modeling representative mechanical problems. The\nresults demonstrate that DCEM outperforms DEM in terms of stress accuracy and\nefficiency and has an advantage in dealing with complex displacement boundary\nconditions, which is supported by theoretical analyses and numerical\nsimulations. We extend DCEM to DCEM-Plus (DCEM-P), adding terms that satisfy\npartial differential equations. Furthermore, we propose a deep complementary\nenergy operator method (DCEM-O) by combining operator learning with physical\nequations. Initially, we train DCEM-O using high-fidelity numerical results and\nthen incorporate complementary energy. DCEM-P and DCEM-O further enhance the\naccuracy and efficiency of DCEM.", "pdf_path": null, "cn_title": "DCEM：一种用于固体力学的深度互补能量方法", "cn_summary": "近年来，深度学习的迅速发展对各个领域产生了重大影响，特别是在解决固体力学领域的偏微分方程（PDEs）方面，得益于神经网络非凡的逼近能力。在求解PDEs时，物理信息神经网络（PINNs）和深度能量方法（DEM）受到了广泛的关注。最小势能原理和互补能原理是固体力学中的两个重要变分原理。然而，广为人知的深度能量方法（DEM）基于最小势能原理，却缺乏至关重要的最小互补能形式。为了填补这一缺口，我们提出基于最小互补能原理的深度互补能量方法（DCEM）。DCEM的输出函数为应力函数，固有地满足平衡方程。我们通过普朗特应力函数和爱里应力函数给出了数值结果，并将DCEM与现有的PINNs和DEM算法在建模代表性机械问题时进行了比较。结果显示，DCEM在应力准确性和效率方面优于DEM，并且在处理复杂位移边界条件上具有优势，这得到了理论分析和数值模拟的支持。我们进一步扩展了DCEM至DCEM-Plus（DCEM-P），加入了满足偏微分方程的项。此外，我们提出了结合操作学习与物理方程的深度互补能量算子方法（DCEM-O）。首先，我们利用高精度数值结果训练DCEM-O，然后引入互补能。DCEM-P和DCEM-O进一步提高了DCEM的准确性和效率。", "update_time": "2024-07-29 16:55:33+00:00", "publish_time": "2023-02-03 04:24:49+00:00"}, {"entry_id": "2404.10148v2", "title": "Node Similarities under Random Projections: Limits and Pathological Cases", "summary": "Random Projections have been widely used to generate embeddings for various\ngraph learning tasks due to their computational efficiency. The majority of\napplications have been justified through the Johnson-Lindenstrauss Lemma. In\nthis paper, we take a step further and investigate how well dot product and\ncosine similarity are preserved by random projections when these are applied\nover the rows of the graph matrix. Our analysis provides new asymptotic and\nfinite-sample results, identifies pathological cases, and tests them with\nnumerical experiments. We specialize our fundamental results to a ranking\napplication by computing the probability of random projections flipping the\nnode ordering induced by their embeddings. We find that, depending on the\ndegree distribution, the method produces especially unreliable embeddings for\nthe dot product, regardless of whether the adjacency or the normalized\ntransition matrix is used. With respect to the statistical noise introduced by\nrandom projections, we show that cosine similarity produces remarkably more\nprecise approximations.", "pdf_path": null, "cn_title": "节点在随机投影下的相似性：极限与病理案例", "cn_summary": "随机投影在各种图学习任务中广泛用于生成嵌入，因其计算效率高。大多数应用通过约翰逊-林登斯特拉斯引理得到验证。本文更进一步，探讨了当在图矩阵的行上应用点积和余弦相似性时，随机投影如何保持这些属性。我们的分析提供了新的渐近性和有限样本结果，并通过数值实验识别并测试了病态情况。我们将基本结果专门应用于排名应用，通过计算随机投影改变其嵌入诱导的节点顺序的概率。我们发现，根据度分布，该方法对点积生成的嵌入特别不可靠，无论使用邻接矩阵还是归一化转移矩阵。与随机投影引入的统计噪声相比，我们展示了余弦相似性产生更为精确的近似。", "update_time": "2024-07-29 16:51:26+00:00", "publish_time": "2024-04-15 21:35:25+00:00"}, {"entry_id": "2407.20164v1", "title": "Language-Conditioned Offline RL for Multi-Robot Navigation", "summary": "We present a method for developing navigation policies for multi-robot teams\nthat interpret and follow natural language instructions. We condition these\npolicies on embeddings from pretrained Large Language Models (LLMs), and train\nthem via offline reinforcement learning with as little as 20 minutes of\nrandomly-collected data. Experiments on a team of five real robots show that\nthese policies generalize well to unseen commands, indicating an understanding\nof the LLM latent space. Our method requires no simulators or environment\nmodels, and produces low-latency control policies that can be deployed directly\nto real robots without finetuning. We provide videos of our experiments at\nhttps://sites.google.com/view/llm-marl.", "pdf_path": null, "cn_title": "基于语言条件的离线强化学习在多机器人导航中的应用", "cn_summary": "我们提出了一种方法，用于为多机器人团队开发能够理解和遵循自然语言指令的导航策略。我们通过预训练大型语言模型（LLM）的嵌入来条件化这些策略，并利用最少20分钟随机收集的数据进行离线强化学习训练。在五台实际机器人组成的团队上的实验表明，这些策略对未见过的命令具有良好的泛化能力，暗示了对LLM潜在空间的理解。我们的方法无需模拟器或环境模型，产生低延迟的控制策略，可以直接部署到实际机器人上而无需微调。我们提供了实验视频供参考，网址为https://sites.google.com/view/llm-marl。", "update_time": "2024-07-29 16:49:30+00:00", "publish_time": "2024-07-29 16:49:30+00:00"}, {"entry_id": "2407.20158v1", "title": "Machine Learning for predicting chaotic systems", "summary": "Predicting chaotic dynamical systems is critical in many scientific fields\nsuch as weather prediction, but challenging due to the characterizing sensitive\ndependence on initial conditions. Traditional modeling approaches require\nextensive domain knowledge, often leading to a shift towards data-driven\nmethods using machine learning. However, existing research provides\ninconclusive results on which machine learning methods are best suited for\npredicting chaotic systems. In this paper, we compare different lightweight and\nheavyweight machine learning architectures using extensive existing databases,\nas well as a newly introduced one that allows for uncertainty quantification in\nthe benchmark results. We perform hyperparameter tuning based on computational\ncost and introduce a novel error metric, the cumulative maximum error, which\ncombines several desirable properties of traditional metrics, tailored for\nchaotic systems. Our results show that well-tuned simple methods, as well as\nuntuned baseline methods, often outperform state-of-the-art deep learning\nmodels, but their performance can vary significantly with different\nexperimental setups. These findings underscore the importance of matching\nprediction methods to data characteristics and available computational\nresources.", "pdf_path": null, "cn_title": "机器学习在预测混沌系统的应用", "cn_summary": "预测混沌动力学系统在许多科学领域至关重要，例如天气预报，但由于初始条件的敏感依赖性，这一任务具有挑战性。传统建模方法需要大量的专业知识，往往导致转向数据驱动的方法利用机器学习。然而，现有研究对哪种机器学习方法最适合预测混沌系统提供了不明确的结果。在这篇论文中，我们使用广泛的现有数据库和一个新引入的数据库进行比较，该数据库允许在基准结果中量化不确定性，对比不同轻量级和重量级的机器学习架构。基于计算成本进行超参数调优，并引入了一种新型错误度量标准——累积最大误差，结合了传统度量标准的一些优点，并针对混沌系统进行了定制。我们的结果显示，精心调整的简单方法以及未经调整的基本方法通常比最先进的深度学习模型表现更好，但其性能随着不同的实验设置可能有很大差异。这些发现强调了匹配预测方法到数据特性和可用计算资源的重要性。", "update_time": "2024-07-29 16:34:47+00:00", "publish_time": "2024-07-29 16:34:47+00:00"}, {"entry_id": "2407.20157v1", "title": "rLLM: Relational Table Learning with LLMs", "summary": "We introduce rLLM (relationLLM), a PyTorch library designed for Relational\nTable Learning (RTL) with Large Language Models (LLMs). The core idea is to\ndecompose state-of-the-art Graph Neural Networks, LLMs, and Table Neural\nNetworks into standardized modules, to enable the fast construction of novel\nRTL-type models in a simple \"combine, align, and co-train\" manner. To\nillustrate the usage of rLLM, we introduce a simple RTL method named\n\\textbf{BRIDGE}. Additionally, we present three novel relational tabular\ndatasets (TML1M, TLF2K, and TACM12K) by enhancing classic datasets. We hope\nrLLM can serve as a useful and easy-to-use development framework for\nRTL-related tasks. Our code is available at:\nhttps://github.com/rllm-project/rllm.", "pdf_path": null, "cn_title": "RLLM：基于LLMs的关系表学习", "cn_summary": "我们引入了rLLM（关系LLM），一个用于大型语言模型（LLMs）与关系表学习（RTL）相结合的PyTorch库。核心思想是将最先进的图神经网络、LLMs和表格神经网络分解为标准化模块，以实现快速构建新型RTL型模型的简单“组合、对齐和共训练”方式。为了说明rLLM的使用方法，我们介绍了一个简单的RTL方法名为BRIDGE。此外，通过增强经典数据集，我们展示了三个新的关系表格数据集（TML1M、TLF2K和TACM12K）。我们希望rLLM能够作为关系表学习相关任务有用且易于使用的开发框架。我们的代码可以在以下位置获取：https://github.com/rllm-project/rllm。", "update_time": "2024-07-29 16:33:40+00:00", "publish_time": "2024-07-29 16:33:40+00:00"}, {"entry_id": "2305.15220v2", "title": "Selection for short-term empowerment accelerates the evolution of homeostatic neural cellular automata", "summary": "Empowerment -- a domain independent, information-theoretic metric -- has\npreviously been shown to assist in the evolutionary search for neural cellular\nautomata (NCA) capable of homeostasis when employed as a fitness function. In\nour previous study, we successfully extended empowerment, defined as maximum\ntime-lagged mutual information between agents' actions and future sensations,\nto a distributed sensorimotor system embodied as an NCA. However, the\ntime-delay between actions and their corresponding sensations was arbitrarily\nchosen. Here, we expand upon previous work by exploring how the time scale at\nwhich empowerment operates impacts its efficacy as an auxiliary objective to\naccelerate the discovery of homeostatic NCAs. We show that shorter time delays\nresult in marked improvements over empowerment with longer delays, when\ncompared to evolutionary selection only for homeostasis. Moreover, we evaluate\nstability and adaptability of evolved NCAs, both hallmarks of living systems\nthat are of interest to replicate in artificial ones. We find that short-term\nempowered NCA are more stable and are capable of generalizing better to unseen\nhomeostatic challenges. Taken together, these findings motivate the use of\nempowerment during the evolution of other artifacts, and suggest how it should\nbe incorporated to accelerate evolution of desired behaviors for them. Source\ncode for the experiments in this paper can be found at:\nhttps://github.com/caitlingrasso/empowered-nca-II.", "pdf_path": null, "cn_title": "为了短期增强而进行的选择加速了稳态神经细胞自动机的进化。", "cn_summary": "赋能——一个独立于领域的、基于信息论的度量标准——先前已被证明在作为适应性函数时，能够辅助神经细胞自动机（NCA）的进化搜索，寻找能够在体内维持稳态的系统。在我们之前的研究所中，成功地将赋能定义为行动者行为与未来感觉之间的最大时间滞后互信息，扩展到了由NCA构成的分布式传感器-运动系统中。然而，行动与其相应感觉之间的时间延迟是任意选择的。在此，我们进一步研究了赋能操作的时间尺度如何影响其作为辅助目标的有效性，以加速发现具有稳态功能的NCA。我们展示了与仅通过进化选择来寻找稳态相比，较短的时间延迟导致了显著的改善。此外，我们评估了进化后的NCA的稳定性和适应性，这是生活系统中的两个重要特征，并且对于复制到人工系统中同样感兴趣。我们发现，短期赋能的NCA更为稳定，并且能够在未见的稳态挑战中更好地泛化。综合这些发现，它们鼓励在进化其他制品时使用赋能，并提出了如何将其整合以加速对所需行为的进化的建议。实验代码可在以下链接中找到：https://github.com/caitlingrasso/empowered-nca-II.", "update_time": "2024-07-29 16:30:49+00:00", "publish_time": "2023-05-24 15:01:30+00:00"}, {"entry_id": "2407.20152v1", "title": "Hierarchically Disentangled Recurrent Network for Factorizing System Dynamics of Multi-scale Systems", "summary": "We present a knowledge-guided machine learning (KGML) framework for modeling\nmulti-scale processes, and study its performance in the context of streamflow\nforecasting in hydrology. Specifically, we propose a novel hierarchical\nrecurrent neural architecture that factorizes the system dynamics at multiple\ntemporal scales and captures their interactions. This framework consists of an\ninverse and a forward model. The inverse model is used to empirically resolve\nthe system's temporal modes from data (physical model simulations, observed\ndata, or a combination of them from the past), and these states are then used\nin the forward model to predict streamflow. In a hydrological system, these\nmodes can represent different processes, evolving at different temporal scales\n(e.g., slow: groundwater recharge and baseflow vs. fast: surface runoff due to\nextreme rainfall). A key advantage of our framework is that once trained, it\ncan incorporate new observations into the model's context (internal state)\nwithout expensive optimization approaches (e.g., EnKF) that are traditionally\nused in physical sciences for data assimilation. Experiments with several river\ncatchments from the NWS NCRFC region show the efficacy of this ML-based data\nassimilation framework compared to standard baselines, especially for basins\nthat have a long history of observations. Even for basins that have a shorter\nobservation history, we present two orthogonal strategies of training our FHNN\nframework: (a) using simulation data from imperfect simulations and (b) using\nobservation data from multiple basins to build a global model. We show that\nboth of these strategies (that can be used individually or together) are highly\neffective in mitigating the lack of training data. The improvement in forecast\naccuracy is particularly noteworthy for basins where local models perform\npoorly because of data sparsity.", "pdf_path": null, "cn_title": "分层解耦循环网络：多尺度系统动力学分解方法", "cn_summary": "我们提出了一种知识引导的机器学习（KGML）框架，用于建模多尺度过程，并在水文中的径流预报背景下研究其性能。具体而言，我们提出了一种新颖的层次递归神经架构，该架构在多个时间尺度上分解系统动力学并捕获它们之间的交互。此框架由逆模型和正向模型组成。逆模型被用来从数据（物理模型模拟、观测数据或过去的数据组合）中经验性地解析系统的时态模式，并使用这些状态作为正向模型预测径流的基础。在水文系统中，这些模式可以代表不同进程，在不同的时间尺度上演变（例如，慢速：地下水补给和基流与快速：极端降雨导致的地表径流）。我们的框架的关键优势在于，一旦训练完成，它便能不需昂贵的优化方法（如EnKF）就可将新观察融入模型上下文（内部状态），这些方法传统上在物理科学中用于数据同化。在NWS NCRFC地区的多个流域实验表明，基于机器学习的数据同化框架相较于标准基准的有效性，特别是在有长期观测记录的流域中表现尤为显著。即使对于观测记录较短的流域，我们提出了两种训练我们的FHNN框架的相互独立策略：(a) 使用不完美的模拟数据，(b) 使用来自多个流域的观测数据构建全局模型。我们证明了这两种策略（可以单独使用或结合使用）对于缓解训练数据不足问题具有高度有效性。尤其是在局部模型因数据稀疏而表现不佳的流域中，预报准确性的提高尤其值得注意。", "update_time": "2024-07-29 16:25:43+00:00", "publish_time": "2024-07-29 16:25:43+00:00"}, {"entry_id": "2407.07934v3", "title": "Identifying macro conditional independencies and macro total effects in summary causal graphs with latent confounding", "summary": "Understanding causal relations in dynamic systems is essential in\nepidemiology. While causal inference methods have been extensively studied,\nthey often rely on fully specified causal graphs, which may not always be\navailable in complex dynamic systems. Partially specified causal graphs, such\nas summary causal graphs (SCGs), provide a simplified representation of causal\nrelations, omitting temporal information and focusing on high-level causal\nstructures. This simplification introduces new challenges concerning the types\nof queries of interest: macro queries, which involve relationships between\nclusters represented as vertices in the graph, and micro queries, which pertain\nto relationships between variables that are not directly visible through the\nvertices of the graph. In this paper, we first clearly distinguish between\nmacro conditional independencies and micro conditional independencies and\nbetween macro total effects and micro total effects. Then, we demonstrate the\nsoundness and completeness of the d-separation to identify macro conditional\nindependencies in SCGs. Furthermore, we establish that the do-calculus is sound\nand complete for identifying macro total effects in SCGs. Finally, we give a\ngraphical characterization for the non-identifiability of macro total effects\nin SCGs.", "pdf_path": null, "cn_title": "识别隐匿混杂因素在概要因果图中的宏观条件独立性和宏观总效应", "cn_summary": "在流行病学中，理解动态系统中的因果关系至关重要。尽管因果推断方法已经得到了广泛的研究，但它们往往依赖于完全指定的因果图，而在复杂的动态系统中，这种图可能并不总是可用的。部分指定的因果图（如摘要因果图SCGs），提供了一种简化表示因果关系的方式，它忽略了时间信息，而专注于高级别的因果结构。这种简化带来了新的挑战，特别是与感兴趣查询类型有关的问题：涉及图形中节点表示的簇之间的宏观查询，以及涉及通过图形中节点无法直接看到的变量之间的微观查询。\n\n在这篇论文中，我们首先明确地区分了宏观条件独立性和微观条件独立性，以及宏观总效应和微观总效应。然后，我们展示了在SCGs中识别宏观条件独立性的d分离的正确性和完整性。进一步地，我们证明了do-计算对于在SCGs中识别宏观总效应的正确性和完整性是成立的。最后，我们给出了SCGs中宏观总效应不可识别性的图形特征描述。", "update_time": "2024-07-29 16:24:45+00:00", "publish_time": "2024-07-10 16:03:04+00:00"}, {"entry_id": "2407.20147v1", "title": "Quantum Machine Learning Architecture Search via Deep Reinforcement Learning", "summary": "The rapid advancement of quantum computing (QC) and machine learning (ML) has\ngiven rise to the burgeoning field of quantum machine learning (QML), aiming to\ncapitalize on the strengths of quantum computing to propel ML forward. Despite\nits promise, crafting effective QML models necessitates profound expertise to\nstrike a delicate balance between model intricacy and feasibility on Noisy\nIntermediate-Scale Quantum (NISQ) devices. While complex models offer robust\nrepresentation capabilities, their extensive circuit depth may impede seamless\nexecution on extant noisy quantum platforms. In this paper, we address this\nquandary of QML model design by employing deep reinforcement learning to\nexplore proficient QML model architectures tailored for designated supervised\nlearning tasks. Specifically, our methodology involves training an RL agent to\ndevise policies that facilitate the discovery of QML models without\npredetermined ansatz. Furthermore, we integrate an adaptive mechanism to\ndynamically adjust the learning objectives, fostering continuous improvement in\nthe agent's learning process. Through extensive numerical simulations, we\nillustrate the efficacy of our approach within the realm of classification\ntasks. Our proposed method successfully identifies VQC architectures capable of\nachieving high classification accuracy while minimizing gate depth. This\npioneering approach not only advances the study of AI-driven quantum circuit\ndesign but also holds significant promise for enhancing performance in the NISQ\nera.", "pdf_path": null, "cn_title": "量子机器学习架构通过深度强化学习进行搜索", "cn_summary": "量子计算（QC）和机器学习（ML）的飞速发展催生了量子机器学习（QML）这一新兴领域，旨在利用量子计算的优势推动机器学习的进步。尽管前景广阔，但设计有效的QML模型需要深入的专业知识来在模型复杂性和在Noisy Intermediate-Scale Quantum（NISQ）设备上的可行性之间找到微妙的平衡。复杂的模型提供了强大的表示能力，但其繁复的电路深度可能会阻碍现有嘈杂量子平台上的无缝执行。本文通过应用深度强化学习来探索适合特定监督学习任务的高效QML模型架构，以解决QML模型设计中的这一困境。具体来说，我们的方法包括训练一个RL代理以制定策略，这些策略能够促进无预设答案构造的QML模型的发现。此外，我们还整合了一个自适应机制，用于动态调整学习目标，从而促进代理学习过程的持续改进。通过广泛的数值模拟，我们展示了这种方法在分类任务领域的有效性。我们提出的方法成功识别出VQC架构，这些架构能够在保持高分类精度的同时，最小化门深度。这一开创性方法不仅推进了基于人工智能的量子电路设计的研究，而且对于提升NISQ时代的性能具有重大潜力。", "update_time": "2024-07-29 16:20:51+00:00", "publish_time": "2024-07-29 16:20:51+00:00"}, {"entry_id": "2407.20143v1", "title": "ByteCheckpoint: A Unified Checkpointing System for LLM Development", "summary": "The development of real-world Large Language Models (LLMs) necessitates\ncheckpointing of training states in persistent storage to mitigate potential\nsoftware and hardware failures, as well as to facilitate checkpoint\ntransferring within the training pipeline and across various tasks. Due to the\nimmense size of LLMs, saving and loading checkpoints often incur intolerable\nminute-level stalls, significantly diminishing training efficiency. Besides,\nwhen transferring checkpoints across tasks, checkpoint resharding, defined as\nloading checkpoints into parallel configurations differing from those used for\nsaving, is often required according to the characteristics and resource quota\nof specific tasks. Previous checkpointing systems [16,3,33,6] assume consistent\nparallel configurations, failing to address the complexities of checkpoint\ntransformation during resharding. Furthermore, in the industry platform,\ndevelopers create checkpoints from different training frameworks[23,36,21,11],\neach with its own unique storage and I/O logic. This diversity complicates the\nimplementation of unified checkpoint management and optimization. To address\nthese challenges, we introduce ByteCheckpoint, a PyTorch-native multi-framework\nLLM checkpointing system that supports automatic online checkpoint resharding.\nByteCheckpoint employs a data/metadata disaggregated storage architecture,\ndecoupling checkpoint storage from the adopted parallelism strategies and\ntraining frameworks. We design an efficient asynchronous tensor merging\ntechnique to settle the irregular tensor sharding problem and propose several\nI/O performance optimizations to significantly enhance the efficiency of\ncheckpoint saving and loading. Experimental results demonstrate\nByteCheckpoint's substantial advantages in reducing checkpoint saving (by up to\n529.22X) and loading (by up to 3.51X) costs, compared to baseline methods.", "pdf_path": null, "cn_title": "字节检查点：LLM开发的统一检查点系统", "cn_summary": "现实世界大型语言模型（LLMs）的发展需要在持久存储中保存训练状态的检查点，以应对潜在的软件和硬件故障，并且便于在训练管道中以及跨不同任务进行检查点转移。由于LLMs的规模庞大，保存和加载检查点通常会导致不可接受的分钟级延迟，极大地降低了训练效率。此外，当在不同任务之间转移检查点时，根据特定任务的特性和资源配额，通常需要执行检查点重新分片，即在与保存时使用的并行配置不同的配置下加载检查点。先前的检查点系统[16,3,33,6]假定并行配置一致，未能解决在重新分片过程中检查点转换的复杂性。此外，在工业平台上，开发者从不同的训练框架创建检查点[23,36,21,11]，每个框架都有其独特的存储和I/O逻辑。这种多样性使统一的检查点管理和优化的实现变得复杂。为了解决这些挑战，我们引入了ByteCheckpoint，一个支持自动在线检查点重新分片的PyTorch原生多框架LLM检查点系统。ByteCheckpoint采用数据/元数据分离的存储架构，解耦了检查点存储与所采用的并行化策略和训练框架。我们设计了一种高效的异步张量合并技术来解决不规则张量分块问题，并提出了一系列I/O性能优化措施，显著提高了检查点保存和加载的效率。实验结果表明，与基线方法相比，ByteCheckpoint在减少检查点保存（高达529.22倍）和加载（高达3.51倍）成本方面具有显著优势。", "update_time": "2024-07-29 16:18:20+00:00", "publish_time": "2024-07-29 16:18:20+00:00"}, {"entry_id": "2311.03583v2", "title": "Finding Increasingly Large Extremal Graphs with AlphaZero and Tabu Search", "summary": "This work studies a central extremal graph theory problem inspired by a 1975\nconjecture of Erd\\H{o}s, which aims to find graphs with a given size (number of\nnodes) that maximize the number of edges without having 3- or 4-cycles. We\nformulate this problem as a sequential decision-making problem and compare\nAlphaZero, a neural network-guided tree search, with tabu search, a heuristic\nlocal search method. Using either method, by introducing a curriculum --\njump-starting the search for larger graphs using good graphs found at smaller\nsizes -- we improve the state-of-the-art lower bounds for several sizes. We\nalso propose a flexible graph-generation environment and a\npermutation-invariant network architecture for learning to search in the space\nof graphs.", "pdf_path": null, "cn_title": "利用AlphaZero与禁忌搜索算法寻找日益庞大的极值图", "cn_summary": "本文探讨了一个由1975年Erd\\H{o}s提出的中心极值图论问题，旨在寻找具有给定节点数量的图，以最大化边的数量，同时避免形成3或4阶环。我们将这个问题表述为一个顺序决策问题，并将AlphaZero（神经网络引导的树搜索）与tabu搜索（启发式局部搜索方法）进行比较。通过引入课程设置——利用在较小规模下找到的好图来启动搜索大型图的过程——我们能够改进几种规模下的最新下界。此外，我们还提出了一种灵活的图生成环境和一种对称于排列的网络架构，用于学习在图空间中进行搜索。", "update_time": "2024-07-29 16:13:22+00:00", "publish_time": "2023-11-06 22:29:55+00:00"}, {"entry_id": "2407.20126v1", "title": "Extreme time extrapolation capabilities and thermodynamic consistency of physics-inspired Neural Networks for the 3D microstructure evolution of materials", "summary": "A Convolutional Recurrent Neural Network (CRNN) is trained to reproduce the\nevolution of the spinodal decomposition process in three dimensions as\ndescribed by the Cahn-Hilliard equation. A specialized, physics-inspired\narchitecture is proven to provide close accordance between the predicted\nevolutions and the ground truth ones obtained via conventional integration\nschemes. The method can closely reproduce the evolution of microstructures not\nrepresented in the training set at a fraction of the computational costs.\nExtremely long-time extrapolation capabilities are achieved, up to reaching the\ntheoretically expected equilibrium state of the system, despite the training\nset containing only relatively-short, initial phases of the evolution.\nQuantitative accordance with the decay rate of the Free energy is also\ndemonstrated up to late coarsening stages, providing an example of a\ndata-driven, physically consistent and high-accuracy Machine Learning method\nfor the long timescale simulation of materials.", "pdf_path": null, "cn_title": "物理学启发式神经网络在材料3D微结构演变中的极端时间外推能力和热力学一致性", "cn_summary": "一种卷积循环神经网络（CRNN）被训练用于在三维中重现由Cahn-Hilliard方程描述的相分离过程的演化。证明了一种专门设计、基于物理的架构能够提供预测演化与通过传统积分方案获得的真实值之间的紧密一致性。该方法能够以极低的计算成本精确复制训练集未包含的微观结构的演化。实现了长时间尺度外推能力，直至系统理论上预期的平衡状态，尽管训练集仅包含演化初期相对较短的阶段。还展示了在较晚的粗化阶段与自由能衰减率的量化一致，提供了一个数据驱动、物理一致且高精度机器学习方法的实例，用于材料长时间尺度的模拟。", "update_time": "2024-07-29 15:55:52+00:00", "publish_time": "2024-07-29 15:55:52+00:00"}, {"entry_id": "2407.20122v1", "title": "Tightening the Evaluation of PAC Bounds Using Formal Verification Results", "summary": "Probably Approximately Correct (PAC) bounds are widely used to derive\nprobabilistic guarantees for the generalisation of machine learning models.\nThey highlight the components of the model which contribute to its\ngeneralisation capacity. However, current state-of-the-art results are loose in\napproximating the generalisation capacity of deployed machine learning models.\nConsequently, while PAC bounds are theoretically useful, their applicability\nfor evaluating a model's generalisation property in a given operational design\ndomain is limited. The underlying classical theory is supported by the idea\nthat bounds can be tightened when the number of test points available to the\nuser to evaluate the model increases. Yet, in the case of neural networks, the\nnumber of test points required to obtain bounds of interest is often\nimpractical even for small problems.\n  In this paper, we take the novel approach of using the formal verification of\nneural systems to inform the evaluation of PAC bounds. Rather than using\npointwise information obtained from repeated tests, we use verification results\non regions around test points. We show that conditioning existing bounds on\nverification results leads to a tightening proportional to the underlying\nprobability mass of the verified region.", "pdf_path": null, "cn_title": "利用形式验证结果收紧有界预测区间评估", "cn_summary": "可能近似正确（PAC）边界被广泛应用于推导机器学习模型在概率上的保证，以阐述模型提升能力的构成部分。然而，当前最先进的结果在近似已部署机器学习模型的泛化能力上较为宽松。因此，尽管PAC边界在理论上很有用，但它们在评估给定操作设计领域中模型泛化性质的应用范围有限。支持该经典理论的基础是，当用户可用的测试点数量增加时，可以收紧边界。但在神经网络的情况下，为了获得感兴趣的边界，甚至对于小型问题来说，所需的测试点数量往往难以实现。\n\n本文采取了一种新颖的方法，即将神经系统的形式验证用于指导PAC边界评估。我们不再依赖于重复测试获得的单点信息，而是利用围绕测试点的验证结果。我们展示了基于验证结果对现有边界进行条件化，可以得到与验证区域底层概率质量成比例的收紧。", "update_time": "2024-07-29 15:53:14+00:00", "publish_time": "2024-07-29 15:53:14+00:00"}, {"entry_id": "2407.20119v1", "title": "Adaptive Self-supervised Robust Clustering for Unstructured Data with Unknown Cluster Number", "summary": "We introduce a novel self-supervised deep clustering approach tailored for\nunstructured data without requiring prior knowledge of the number of clusters,\ntermed Adaptive Self-supervised Robust Clustering (ASRC). In particular, ASRC\nadaptively learns the graph structure and edge weights to capture both local\nand global structural information. The obtained graph enables us to learn\nclustering-friendly feature representations by an enhanced graph auto-encoder\nwith contrastive learning technique. It further leverages the clustering\nresults adaptively obtained by robust continuous clustering (RCC) to generate\nprototypes for negative sampling, which can further contribute to promoting\nconsistency among positive pairs and enlarging the gap between positive and\nnegative samples. ASRC obtains the final clustering results by applying RCC to\nthe learned feature representations with their consistent graph structure and\nedge weights. Extensive experiments conducted on seven benchmark datasets\ndemonstrate the efficacy of ASRC, demonstrating its superior performance over\nother popular clustering models. Notably, ASRC even outperforms methods that\nrely on prior knowledge of the number of clusters, highlighting its\neffectiveness in addressing the challenges of clustering unstructured data.", "pdf_path": null, "cn_title": "适应性自我监督鲁棒聚类方法在未知簇数的无结构数据上的应用", "cn_summary": "我们提出了一种新颖的自监督深度聚类方法，专门针对无结构数据，无需预先知道聚类的数量，称为自适应自监督鲁棒聚类（ASRC）。特别地，ASRC能够自适应地学习图结构和边权重，以捕获局部和全局结构信息。获得的图使我们能够通过增强的图自动编码器和对比学习技术来学习有利于聚类的特征表示。进一步地，它利用由鲁棒连续聚类（RCC）自适应获得的聚类结果生成负采样原型，这有助于促进正对之间的一致性并扩大正样本与负样本之间的差距。最后，通过将RCC应用于学习到的特征表示及其一致的图结构和边权重，ASRC获得最终的聚类结果。在七个基准数据集上的大量实验表明，ASRC的有效性，证明了其在与其他流行的聚类模型相比时的优越性能。值得注意的是，ASRC甚至超过了依赖于聚类数量先验知识的方法，在处理无结构数据聚类挑战方面显示出了其有效性。", "update_time": "2024-07-29 15:51:09+00:00", "publish_time": "2024-07-29 15:51:09+00:00"}, {"entry_id": "2407.08623v2", "title": "Surpassing Cosine Similarity for Multidimensional Comparisons: Dimension Insensitive Euclidean Metric (DIEM)", "summary": "The advancement in computational power and hardware efficiency enabled the\ntackling of increasingly complex and high-dimensional problems. While\nartificial intelligence (AI) achieved remarkable results, the interpretability\nof high-dimensional solutions remains challenging. A critical issue is the\ncomparison of multidimensional quantities, which is essential in techniques\nlike Principal Component Analysis (PCA), or k-means clustering. Common metrics\nsuch as cosine similarity, Euclidean distance, and Manhattan distance are often\nused for such comparisons - for example in muscular synergies of the human\nmotor control system. However, their applicability and interpretability\ndiminish as dimensionality increases. This paper provides a comprehensive\nanalysis of the effects of dimensionality on these metrics. Our results reveal\nsignificant limitations of cosine similarity, particularly its dependency on\nthe dimensionality of the vectors, leading to biased and less interpretable\noutcomes. To address this, we introduce the Dimension Insensitive Euclidean\nMetric (DIEM) which demonstrates superior robustness and generalizability\nacross dimensions. DIEM maintains consistent variability and eliminates the\nbiases observed in traditional metrics, making it a reliable tool for\nhigh-dimensional comparisons. This novel metric has the potential to replace\ncosine similarity, providing a more accurate and insightful method to analyze\nmultidimensional data in fields ranging from neuromotor control to machine and\ndeep learning.", "pdf_path": null, "cn_title": "超越余弦相似度的多维比较：维度不敏感欧氏度量（DIEM）", "cn_summary": "计算能力与硬件效率的提升使得我们能够解决日益复杂和高维的问题。虽然人工智能（AI）取得了显著成果，但高维解决方案的可解释性仍然是一个挑战。关键问题在于多维量的比较，这对于如主成分分析（PCA）、或k-均值聚类等技术至关重要。常用的度量标准如余弦相似度、欧氏距离和曼哈顿距离通常用于此类比较，例如在人类运动控制系统中的肌肉协同作用。然而，随着维度的增加，这些度量标准的应用性和可解释性会减弱。本文全面分析了维度对这些度量标准的影响。我们的结果揭示了余弦相似度的重大局限性，尤其是它对向量维度的依赖导致了有偏见且可解释性较差的结果。为了应对这一问题，我们引入了维度不敏感欧氏度量（DIEM），证明了其在不同维度下具有优越的鲁棒性和泛化能力。DIEM保持了一致的变化性，并消除了传统度量中观察到的偏见，使其成为高维比较的可靠工具。这一新颖的度量方法有可能替代余弦相似度，提供一种更准确、更深入的方法来分析从神经运动控制到机器学习和深度学习等领域的多维数据。", "update_time": "2024-07-29 15:49:29+00:00", "publish_time": "2024-07-11 16:00:22+00:00"}, {"entry_id": "2407.20109v1", "title": "Diffusion-DICE: In-Sample Diffusion Guidance for Offline Reinforcement Learning", "summary": "One important property of DIstribution Correction Estimation (DICE) methods\nis that the solution is the optimal stationary distribution ratio between the\noptimized and data collection policy. In this work, we show that DICE-based\nmethods can be viewed as a transformation from the behavior distribution to the\noptimal policy distribution. Based on this, we propose a novel approach,\nDiffusion-DICE, that directly performs this transformation using diffusion\nmodels. We find that the optimal policy's score function can be decomposed into\ntwo terms: the behavior policy's score function and the gradient of a guidance\nterm which depends on the optimal distribution ratio. The first term can be\nobtained from a diffusion model trained on the dataset and we propose an\nin-sample learning objective to learn the second term. Due to the\nmulti-modality contained in the optimal policy distribution, the transformation\nin Diffusion-DICE may guide towards those local-optimal modes. We thus generate\na few candidate actions and carefully select from them to approach\nglobal-optimum. Different from all other diffusion-based offline RL methods,\nthe guide-then-select paradigm in Diffusion-DICE only uses in-sample actions\nfor training and brings minimal error exploitation in the value function. We\nuse a didatic toycase example to show how previous diffusion-based methods fail\nto generate optimal actions due to leveraging these errors and how\nDiffusion-DICE successfully avoids that. We then conduct extensive experiments\non benchmark datasets to show the strong performance of Diffusion-DICE.", "pdf_path": null, "cn_title": "扩散-DICE：基于样本内扩散指导的离线强化学习", "cn_summary": "分布校正估计(Distribution Correction Estimation, DICE)方法的一个重要特性是，其解是优化策略与数据收集策略之间的最优稳态分布比率。在本文中，我们展示了基于DICE的方法可以被视为从行为分布到最优策略分布的转换。在此基础上，我们提出了一种新颖的方法——扩散-DICE（Diffusion-DICE），该方法直接使用扩散模型执行这一转换。我们发现，最优策略的评分函数可以分解为两个部分：行为策略的评分函数和依赖于最优分布比率的指导项的梯度。第一部分可以从用于训练的数据集上训练的扩散模型中获得，并提出了一个样本内学习目标来学习第二部分。由于最优策略分布包含多模态性，Diffusion-DICE中的转换可能会引导至局部最优模式。因此，我们生成了几种候选动作，并从中仔细选择以接近全局最优。与所有其他基于扩散的离线强化学习方法不同，Diffusion-DICE中的指导-选择范式仅使用样本内的动作进行训练，从而在价值函数中带来最小的错误利用。我们使用了一个示范性玩具案例来展示之前的基于扩散的方法为何由于利用这些错误而无法生成最优动作，以及Diffusion-DICE如何成功避免了这种情况。然后，我们在基准数据集上进行了广泛的实验，以展示Diffusion-DICE的强大性能。", "update_time": "2024-07-29 15:36:42+00:00", "publish_time": "2024-07-29 15:36:42+00:00"}, {"entry_id": "2407.20105v1", "title": "Strong Copyright Protection for Language Models via Adaptive Model Fusion", "summary": "The risk of language models unintentionally reproducing copyrighted material\nfrom their training data has led to the development of various protective\nmeasures. In this paper, we propose model fusion as an effective solution to\nsafeguard against copyright infringement. In particular, we introduce\nCopyright-Protecting Fusion (CP-Fuse), an algorithm that adaptively combines\nlanguage models to minimize the reproduction of protected materials. CP-Fuse is\ninspired by the recently proposed Near-Access Free (NAF) framework and\nadditionally incorporates a desirable balancing property that we demonstrate\nprevents the reproduction of memorized training data. Our results show that\nCP-Fuse significantly reduces the memorization of copyrighted content while\nmaintaining high-quality text and code generation. Furthermore, we demonstrate\nhow CP-Fuse can be integrated with other techniques for enhanced protection.", "pdf_path": null, "cn_title": "通过自适应模型融合强化语言模型的版权保护", "cn_summary": "语言模型在无意中复制其训练数据中的受版权保护材料的风险，导致了各种保护措施的开发。本文提出模型融合作为防止侵权的有效解决方案。具体地，我们引入了版权保护融合（CP-Fuse）算法，该算法适应性地结合语言模型以最小化对受保护材料的复制。CP-Fuse灵感来源于最近提出的接近无访问自由（NAF）框架，并且还融入了一个我们证明可以防止记忆训练数据复制的可喜平衡属性。我们的结果显示，CP-Fuse显著减少了对受版权保护内容的记忆，同时保持高质量的文字和代码生成。此外，我们展示了如何将CP-Fuse与其他增强保护技术集成的方法。", "update_time": "2024-07-29 15:32:30+00:00", "publish_time": "2024-07-29 15:32:30+00:00"}, {"entry_id": "2407.20100v1", "title": "F-KANs: Federated Kolmogorov-Arnold Networks", "summary": "In this paper, we present an innovative federated learning (FL) approach that\nutilizes Kolmogorov-Arnold Networks (KANs) for classification tasks. By\nutilizing the adaptive activation capabilities of KANs in a federated\nframework, we aim to improve classification capabilities while preserving\nprivacy. The study evaluates the performance of federated KANs (F- KANs)\ncompared to traditional Multi-Layer Perceptrons (MLPs) on classification task.\nThe results show that the F-KANs model significantly outperforms the federated\nMLP model in terms of accuracy, precision, recall, F1 score and stability, and\nachieves better performance, paving the way for more efficient and\nprivacy-preserving predictive analytics.", "pdf_path": null, "cn_title": "F-KANs: 联邦柯尔莫哥洛夫-阿诺德网络", "cn_summary": "在这篇论文中，我们提出了一种创新的联邦学习（FL）方法，利用柯尔莫哥洛夫-阿诺德网络（KANs）进行分类任务。通过在联邦框架下利用KANs的自适应激活能力，旨在提高分类能力的同时保持隐私。研究评估了联邦KANs（F-KANs）与传统多层感知器（MLPs）在分类任务上的性能。结果显示，F-KANs模型在准确率、精确度、召回率、F1分数和稳定性方面均显著优于联邦MLP模型，并且达到了更好的性能，为更高效且隐私保护的预测分析铺平了道路。", "update_time": "2024-07-29 15:28:26+00:00", "publish_time": "2024-07-29 15:28:26+00:00"}, {"entry_id": "2407.14435v2", "title": "Jumping Ahead: Improving Reconstruction Fidelity with JumpReLU Sparse Autoencoders", "summary": "Sparse autoencoders (SAEs) are a promising unsupervised approach for\nidentifying causally relevant and interpretable linear features in a language\nmodel's (LM) activations. To be useful for downstream tasks, SAEs need to\ndecompose LM activations faithfully; yet to be interpretable the decomposition\nmust be sparse -- two objectives that are in tension. In this paper, we\nintroduce JumpReLU SAEs, which achieve state-of-the-art reconstruction fidelity\nat a given sparsity level on Gemma 2 9B activations, compared to other recent\nadvances such as Gated and TopK SAEs. We also show that this improvement does\nnot come at the cost of interpretability through manual and automated\ninterpretability studies. JumpReLU SAEs are a simple modification of vanilla\n(ReLU) SAEs -- where we replace the ReLU with a discontinuous JumpReLU\nactivation function -- and are similarly efficient to train and run. By\nutilising straight-through-estimators (STEs) in a principled manner, we show\nhow it is possible to train JumpReLU SAEs effectively despite the discontinuous\nJumpReLU function introduced in the SAE's forward pass. Similarly, we use STEs\nto directly train L0 to be sparse, instead of training on proxies such as L1,\navoiding problems like shrinkage.", "pdf_path": null, "cn_title": "提前跳跃：通过跳跃ReLU稀疏自动编码器提升重构精度", "cn_summary": "稀疏自动编码器（Sparse Autoencoders, SAEs）是一种有前景的无监督方法，旨在识别语言模型（Language Model, LM）激活中的因果相关且可解释的线性特征。为了在下游任务中发挥作用，SAEs需要以忠实的方式分解LM激活；然而，分解必须是稀疏的——这是两个存在紧张关系的目标。在这篇论文中，我们引入了JumpReLU SAEs，它在给定稀疏级别上，在Gemma 2 9B激活上的重构精确度达到了最先进的水平，与近期的其他进展如门控和TopK SAEs相比。我们还展示了这种改进不会以牺牲可解释性为代价，通过手动和自动化可解释性研究。JumpReLU SAEs是对常规（ReLU）SAEs的简单修改——我们将ReLU替换为不连续的JumpReLU激活函数——并且具有类似的训练和运行效率。通过在原理上合理地使用直通估计器（Straight-through-estimator, STEs），我们展示了即使在SAE的前向传播中引入了不连续的JumpReLU函数，也有可能有效地训练JumpReLU SAEs。同样，我们直接使用STEs来训练L0使其稀疏，而不是在代理如L1上进行训练，从而避免了像压缩这样的问题。", "update_time": "2024-07-29 15:27:03+00:00", "publish_time": "2024-07-19 16:07:19+00:00"}, {"entry_id": "2406.01805v2", "title": "TabMDA: Tabular Manifold Data Augmentation for Any Classifier using Transformers with In-context Subsetting", "summary": "Tabular data is prevalent in many critical domains, yet it is often\nchallenging to acquire in large quantities. This scarcity usually results in\npoor performance of machine learning models on such data. Data augmentation, a\ncommon strategy for performance improvement in vision and language tasks,\ntypically underperforms for tabular data due to the lack of explicit symmetries\nin the input space. To overcome this challenge, we introduce TabMDA, a novel\nmethod for manifold data augmentation on tabular data. This method utilises a\npre-trained in-context model, such as TabPFN, to map the data into an embedding\nspace. TabMDA performs label-invariant transformations by encoding the data\nmultiple times with varied contexts. This process explores the learned\nembedding space of the underlying in-context models, thereby enlarging the\ntraining dataset. TabMDA is a training-free method, making it applicable to any\nclassifier. We evaluate TabMDA on five standard classifiers and observe\nsignificant performance improvements across various tabular datasets. Our\nresults demonstrate that TabMDA provides an effective way to leverage\ninformation from pre-trained in-context models to enhance the performance of\ndownstream classifiers. Code is available at\nhttps://github.com/AdrianBZG/TabMDA.", "pdf_path": null, "cn_title": "TabMDA：表格数据流形增强方法，适用于任何分类器，使用基于上下文子集的转换器", "cn_summary": "表格数据在许多关键领域普遍存在，然而，获取大量此类数据往往具有挑战性。这种稀缺性通常导致机器学习模型在处理此类数据时性能不佳。对于视觉和语言任务中常用的性能提升策略——数据增强，对于表格数据的表现通常不佳，主要是因为输入空间缺乏明确的对称性。为了克服这一挑战，我们引入了TabMDA，一种针对表格数据的流形数据增强方法。该方法利用预训练的上下文模型（如TabPFN）将数据映射到嵌入空间。通过多次以不同的上下文编码数据，TabMDA执行不变性的标签转换。这个过程探索了底层上下文模型学习的嵌入空间，从而扩大了训练数据集。TabMDA是一个无需训练的方法，因此适用于任何分类器。我们在五个标准分类器上评估了TabMDA，并观察到了各种表格数据集上的显著性能提升。我们的结果显示，TabMDA提供了一种有效的方法，利用预训练的上下文模型的信息来增强下游分类器的性能。相关代码可访问 https://github.com/AdrianBZG/TabMDA。", "update_time": "2024-07-29 15:08:17+00:00", "publish_time": "2024-06-03 21:51:13+00:00"}, {"entry_id": "2407.20080v1", "title": "UniTTA: Unified Benchmark and Versatile Framework Towards Realistic Test-Time Adaptation", "summary": "Test-Time Adaptation (TTA) aims to adapt pre-trained models to the target\ndomain during testing. In reality, this adaptability can be influenced by\nmultiple factors. Researchers have identified various challenging scenarios and\ndeveloped diverse methods to address these challenges, such as dealing with\ncontinual domain shifts, mixed domains, and temporally correlated or imbalanced\nclass distributions. Despite these efforts, a unified and comprehensive\nbenchmark has yet to be established. To this end, we propose a Unified\nTest-Time Adaptation (UniTTA) benchmark, which is comprehensive and widely\napplicable. Each scenario within the benchmark is fully described by a Markov\nstate transition matrix for sampling from the original dataset. The UniTTA\nbenchmark considers both domain and class as two independent dimensions of data\nand addresses various combinations of imbalance/balance and\ni.i.d./non-i.i.d./continual conditions, covering a total of \\( (2 \\times 3)^2 =\n36 \\) scenarios. It establishes a comprehensive evaluation benchmark for\nrealistic TTA and provides a guideline for practitioners to select the most\nsuitable TTA method. Alongside this benchmark, we propose a versatile UniTTA\nframework, which includes a Balanced Domain Normalization (BDN) layer and a\nCOrrelated Feature Adaptation (COFA) method--designed to mitigate distribution\ngaps in domain and class, respectively. Extensive experiments demonstrate that\nour UniTTA framework excels within the UniTTA benchmark and achieves\nstate-of-the-art performance on average. Our code is available at\n\\url{https://github.com/LeapLabTHU/UniTTA}.", "pdf_path": null, "cn_title": "UniTTA: 统一基准与多功能框架，旨在实现贴近现实的测试时适应", "cn_summary": "测试时调整（TTA）旨在通过测试阶段对预先训练的模型进行适应，以使其更好地针对目标领域进行工作。实际上，这种可适应性受到多种因素的影响。研究者已识别出多种具有挑战性的场景，并开发了多样化的策略来解决这些挑战，如应对连续域漂移、混合域以及时间相关或不平衡类分布等问题。尽管已经做出了努力，但尚未建立统一且全面的基准评估体系。为此，我们提出了一种统一对比测试时调整（UniTTA）基准，该基准既全面又广泛适用。基准中的每个场景都由一个马尔科夫状态转换矩阵完整描述，用于从原始数据集中采样。UniTTA基准考虑了域和类作为数据的两个独立维度，并解决了不平衡/平衡和独立同分布/非独立同分布/连续条件等各种组合，总共覆盖了\\( (2 \\times 3)^2 = 36 \\)种场景。它为现实世界中的TTA提供了全面的评估基准，并为实践者提供了一个指南，以选择最合适的TTA方法。与这个基准一同提出的是一种灵活的UniTTA框架，包括平衡域归一化（BDN）层和相关特征调整（COFA）方法——分别设计用于减少域和类之间的分布差距。广泛的实验表明，我们的UniTTA框架在UniTTA基准中表现突出，并且平均性能达到了最先进的水平。我们的代码可以在网址\\url{https://github.com/LeapLabTHU/UniTTA}获取。", "update_time": "2024-07-29 15:04:53+00:00", "publish_time": "2024-07-29 15:04:53+00:00"}, {"entry_id": "2407.01445v2", "title": "FastCLIP: A Suite of Optimization Techniques to Accelerate CLIP Training with Limited Resources", "summary": "Existing studies of training state-of-the-art Contrastive Language-Image\nPretraining (CLIP) models on large-scale data involve hundreds of or even\nthousands of GPUs due to the requirement of a large batch size. However, such a\nlarge amount of resources is not accessible to most people. While advanced\ncompositional optimization techniques for optimizing global contrastive losses\nhave been demonstrated effective for removing the requirement of large batch\nsize, their performance on large-scale data remains underexplored and not\noptimized. To bridge the gap, this paper explores several aspects of CLIP\ntraining with limited resources (e.g., up to tens of GPUs). First, we introduce\nFastCLIP, a general CLIP training framework built on advanced compositional\noptimization techniques while designed and optimized for the distributed\nsetting. Our framework is equipped with an efficient gradient reduction\nstrategy to reduce communication overhead. Second, to further boost training\nefficiency, we investigate three components of the framework from an\noptimization perspective: the schedule of the inner learning rate, the update\nrules of the temperature parameter and the model parameters, respectively.\nExperiments on different strategies for each component shed light on how to\nconduct CLIP training more efficiently. Finally, we benchmark the performance\nof FastCLIP and the state-of-the-art training baseline (OpenCLIP) on different\ncompute scales up to 32 GPUs on 8 nodes, and three data scales ranging from 2.7\nmillion, 9.1 million to 315 million image-text pairs to demonstrate the\nsignificant improvement of FastCLIP in the resource-limited setting. We release\nthe code of FastCLIP at https://github.com/Optimization-AI/fast_clip .", "pdf_path": null, "cn_title": "快速CLIP：一套优化技术套件，用于在资源有限的情况下加速CLIP训练", "cn_summary": "现有对大规模数据上训练最先进的对比语言-图像预训练（CLIP）模型的研究，通常需要数百乃至数千个GPU，这是由于需要较大的批次大小。然而，如此大量的资源并非大多数人都能获取到。尽管已证明通过高级组合优化技术来优化全局对比损失可以有效去除大批次需求，但在大规模数据上的性能仍处于未充分探索和优化的状态。为了填补这一差距，本文探讨了在有限资源（例如至多数十个GPU）下进行CLIP训练的几个方面。\n\n首先，我们引入了FastCLIP，这是一个基于高级组合优化技术构建的一般性CLIP训练框架，并针对分布式环境进行了设计和优化。我们的框架配备了一种高效梯度减少策略，以降低通信开销。其次，为了进一步提升训练效率，从优化的角度探讨了框架的三个组件：内部学习率的时间表、温度参数的更新规则以及模型参数的更新规则。不同策略的实验揭示了如何更有效地执行CLIP训练。\n\n最后，我们在32个GPU分布在8个节点上，以及三个数据规模范围内的实验，从270万、910万到3.15亿张图像-文本对，与最先进的训练基准（OpenCLIP）进行了性能基准测试，以展示FastCLIP在资源受限情况下的显著改进。我们提供了FastCLIP的代码，发布于https://github.com/Optimization-AI/fast_clip 。", "update_time": "2024-07-29 15:04:15+00:00", "publish_time": "2024-07-01 16:37:18+00:00"}, {"entry_id": "2407.20070v1", "title": "An Interpretable Rule Creation Method for Black-Box Models based on Surrogate Trees -- SRules", "summary": "As artificial intelligence (AI) systems become increasingly integrated into\ncritical decision-making processes, the need for transparent and interpretable\nmodels has become paramount. In this article we present a new ruleset creation\nmethod based on surrogate decision trees (SRules), designed to improve the\ninterpretability of black-box machine learning models. SRules balances the\naccuracy, coverage, and interpretability of machine learning models by\nrecursively creating surrogate interpretable decision tree models that\napproximate the decision boundaries of a complex model. We propose a systematic\nframework for generating concise and meaningful rules from these surrogate\nmodels, allowing stakeholders to understand and trust the AI system's\ndecision-making process. Our approach not only provides interpretable rules,\nbut also quantifies the confidence and coverage of these rules. The proposed\nmodel allows to adjust its parameters to counteract the lack of\ninterpretability by precision and coverage by allowing a near perfect fit and\nhigh interpretability of some parts of the model . The results show that SRules\nimproves on other state-of-the-art techniques and introduces the possibility of\ncreating highly interpretable specific rules for specific sub-parts of the\nmodel.", "pdf_path": null, "cn_title": "基于替代树的黑盒模型可解释规则生成方法——SRules", "cn_summary": "随着人工智能（AI）系统在关键决策过程中的日益整合，对透明和可解释模型的需求变得至关重要。本文介绍了一种基于代理决策树（SRules）的新规则集创建方法，旨在改进黑盒机器学习模型的可解释性。SRules通过递归创建近似复杂模型决策边界的可解释决策树模型，平衡了机器学习模型的准确度、覆盖范围和可解释性。我们提出了一套系统框架，从这些代理模型中生成简洁且有意义的规则，使利益相关者能够理解和信任AI系统的决策过程。我们的方法不仅提供了可解释的规则，而且还量化了这些规则的置信度和覆盖率。所提出的模型允许调整其参数以抵消可解释性的缺乏，并通过允许对模型的部分进行近乎完美的拟合和高可解释性来提高精确度和覆盖率。结果显示，SRules在其他最先进的技术上有所改进，并引入了为模型特定子部分创建高度可解释的特定规则的可能性。", "update_time": "2024-07-29 14:56:56+00:00", "publish_time": "2024-07-29 14:56:56+00:00"}]